{"Memes/SOLID-principles-with-penguins":{"title":"SOLID principles with penguins","links":[],"tags":["memes"],"content":"\n\n\n\n\n"},"Software-Engineering/Infographs/Explaining-CI-CD-to-a-kid":{"title":"Explaining CI-CD to a kid","links":["attachments/Pasted-image-20241024154043.png"],"tags":["tech"],"content":"\nOpen image"},"Software-Engineering/Infographs/Software-architecture-styles":{"title":"Software architecture styles","links":["attachments/Pasted-image-20241024155608.png"],"tags":["tech"],"content":"\nOpen image"},"Software-Engineering/Infographs/System-Design-Blueprint":{"title":"System Design Blueprint","links":[],"tags":["tech"],"content":"Purchase hi-res link\nA comprehensive visual guide that provides developers with a quick and easy reference to key concepts and best practices in system design. This handy cheatsheet or blueprint covers essential topics such as DNS, load balancing, API Gateway, video and image handling, caching, databases, unique ID generation, standard components like payment and recommendation services, and chat and streaming protocols. With this valuable resource at your fingertips, you’ll be well-equipped to tackle the challenges of designing and implementing scalable, efficient, and reliable systems.\nReferences\n\nblog.bytebytego.com/p/ep56-system-design-blueprint-the\nOriginal paper: www.ia.pw.edu.pl/~tkruk/edu/ersms/articles/SystemDesignBlueprint_TheUltimateGuide.pdf\n"},"TIL/concepts/Digital-Garden":{"title":"Digital Garden","links":[],"tags":["til"],"content":"A digital garden is a personal, open, and evolving collection of notes, ideas, and resources shared on the internet, typically in a non-linear format. Unlike traditional blogs or websites that emphasize polished, finished content, a digital garden is more focused on the growth of knowledge over time, allowing for updates, revisions, and exploration of thoughts in various stages of development.\nBlog post: dev.to/jbranchaud/the-digital-garden-l10"},"TIL/concepts/Learn-in-Public":{"title":"Learn in Public","links":[],"tags":["til"],"content":"“Learning in public” refers to the practice of sharing your learning journey, progress, and even mistakes openly, often through blog posts, social media, videos, or other platforms. The idea is to publicly document what you’re learning, whether it’s a new skill, a subject, or a project, while engaging with a broader community.\nThis approach has several benefits:\n\nAccountability: By sharing your progress, you’re more likely to stick with your goals.\nFeedback: You can receive helpful feedback and advice from others, often accelerating your learning process.\nBuilding a reputation: It helps build your personal brand as someone who is curious, consistent, and willing to share knowledge.\nHelping others: Your experiences, challenges, and solutions can be valuable for others going through similar learning processes.\n\nFor example, someone learning a new programming language might write regular blog posts about what they’ve learned, or post code snippets and discuss challenges and breakthroughs on GitHub or Twitter.\nReferences:\n\nwww.youtube.com/watch\nwww.swyx.io/learn-in-public\n"},"TIL/obsidian/Exporting-vault-to-HTML-and-publish-it":{"title":"Exporting vault to HTML and publish it","links":["tags/TIL"],"tags":["TIL"],"content":"TIL to export my ObsidianMD vault as HTML and publish it on Github Pages. Tried Jekyll first, wasn’t quite what I was looking for, so I used the Obsidian Webpage Export (github.com/KosmosisDire/obsidian-webpage-export). Unfortunately the documentation wasn’t available, so I made it work by intuition, but at least I have now my personal digital garden where I can share what I learn as a software engineer.\nVery immature for now, but hopefully the beginning of something greater. Check out my garden!"},"TIL/obsidian/Quartz":{"title":"Quartz","links":["tags/til"],"tags":["til"],"content":"til about Quartz (github.com/jackyzha0/quartz), a very nice framework that transforms my obsidian vault into a beautiful website."},"TIL/obsidian/Slides-in-Obsidian":{"title":"Slides in Obsidian","links":[],"tags":[],"content":"You can create awesome presentations with ObsidianMD and the Advanced Slides plugin. Check it at mszturc.github.io/obsidian-advanced-slides/.\nIncredibly beautiful and simple.\n"},"index":{"title":"Welcome to Quartz","links":[],"tags":[],"content":"Hey ho! Welcome to my digital garden. I’m David Jiménez, Senior software engineer currently working @ Scopely Games. Restless and curious, I’ve worked +10 years as developer and architect across a variety of fields, ranging from industries like insurance, digital marketing, pharma, social networks and now videogames. But, above everything else, I am mostly a problem solver who thinks and tries to fit the best solution to the problem at hand instead of always using the same tool over and over again.\nThis garden is the place where I store all the knowledge I’m acquiring as time goes by, in an effort to follow the Learning in Public philosophy where I can improve my learning method by sharing what I know with everybody else. I hope by reading my notes you feel comfortable.\nSome places where you can get in touch with me:\n\nGithub\nLinkedIn\nDEV.to where I share my thoughts on technical posts\n"}}