{"Gaming-and-boardgames/Alone-among-the-stars/Planet-Moradan":{"title":"Planet Moradan","links":[],"tags":["boardgames","log"],"content":"I landed in this planet without any issue. In fact, the ship’s sensors detected a clean atmosphere rich in oxygen and a mild temperature, so I could safely leave it without my space helmet.\nTo my surprise, the atmosphere smells like fresh mint. Charmed by it, I started walking, in hopes of finding the source of such scent. I literally lost the sense of time in such a way that it immediately became deep night. Looking at the sky, I could appreciate the three moons at work: they all reflected the light of the sun, casting a moonbeam that illuminated the surface of the planet with a gentle blue-ish green environment that made me feel cozy and warm.\nDrugged by this whirlwind of sensations, I stumbled upon the source of the mint scent to my surprise: a giant, thick flower with a purple blossom. It was majestic. I spent a minute to smell the flower up close as if I wanted to take some of that scent during the rest of my journey in this planet.\nI took a proper photo, collected some samples and moved on to my next target.\nAbandoning the lush greenery of the fields, I headed north with my portable plane till I came across what seemed a cave formation.\nCurious, I entered and started to descend into the endless darkness. The more I delved into it, the colder it was getting up to the point of freezing. It was getting so cold I had to put my special suit for harsh climates. What a change of pace compared to the previous greenery I was welcomed before this!\nAmidst the darkness though I saw a spark of light in a wall which grabbed my attention. Curious, I grabbed a pickaxe (it was a difficult endeavor to grab it with my thick gloves) and started digging.\nAt a point, the wall collapsed, and I quickly stepped back before I would be swallowed by the rocks. The effort has been worthwhile though: I’ve found a chamber made of ice and crystals. A tiny beam of light from a hole entered the place, but the walls of the chamber were as polished and smooth as mirrors, which reflected and bounced the light on all directions, creating a light you would never believe you would find so deep in the earth.\nAstonishing is not a word I would use to describe this.\nBut that room was not the only surprised that awaited me. A rapidly moving shadow passed by the room. At first I thought that my eyes were deceiving me because I was just dazed and blinded by a reflected light beam, but after a second look it was clear that I was not dreaming.\nThere it was, some kind of avian creature, with a sharp beak with fur instead of feathers. It was not like those birds called “penguins” my Earth biology book talked about. It was more like a blue phoenix, with a long, beautiful tail consisting of three appendices.\nI tried calling it using my bird whistle to have a closer look upon it. Unfortunately no response. It got scared and flew off. What a missed opportunity…"},"Gaming-and-boardgames/Alone-among-the-stars/Planet-Sulfura":{"title":"Planet Sulfura","links":[],"tags":["boardgames","log"],"content":"As I abandoned the ship’s pod after landing, I started investigating a field with grass as tall as the biggest of the trees on earth. It felt as a labyrinth. Suddenly, I tripped and when I raised my head, there it was: a blue fox with two tails which playfully was jumping side by side surrounding me. It was beautiful, charming and eerie. He looked harmless, so I stood up, petted it, gave it a small chunk of my multi-nutrient buns, and kept moving.\nAfter I left the tall grass forest, I bumped into a cascade of purple water. It was relaxing and the white noise generated by the splashing water made me fall sleep by accident, resting my head on top of my traveling backpack.\nThen I heard a noise, like a violent splash which suddenly woke me up. Curious I get close to the water, and I saw a green glow which grabbed my attention.\nMy curiosity got the best of me, equipped my scuba diving suit, and then jumped into the purple waters, below the cascade. And what a surprise, it was a glowing crab. I took some photos of it, surprised by the discovery.\nAfter the crab, I noticed in the dark area a small underwater cave. Something was definitely moving, so I took my time to check that cave.\nThe cave was small, and dark. And then I felt like something grabbed my feet, making me unable to move. I got entangled into some kind of weed. It startled me and I was scared.\nQuickly I picked up my knife and cut it, though it was an arduous labor. The weed seemed to regrow quickly as I cut it, much like the head of an hydra. Through persistence I managed to escape, but shush, that was scary.\nAfter the diving adventure I continued walking, towards a Volcano. The purple color of the water and distinctive glow of the wildlife is most likely due to the high concentration of sulfur in this planet, so to gather some more knowledge it makes sense to go and investigate the volcanoes of the area.\nDuring the climb, I stopped for a second for a short snack, sitting on a rock. However, I was completely oblivious to the fact that the rock had some inscription in an alien language, and it held some kind of special shape, like a perfectly cut, squared diamond shape. It resembles some kind of altar. Maybe it was culturally bound to the volcano for the former inhabitants of the planet, as some kind of ritual?"},"Gaming-and-boardgames/RPG-sessions/Starforged-mindmap":{"title":"Starforged mindmap","links":[],"tags":["role"],"content":""},"Gaming-and-boardgames/Useful-oracles-for-TTRPG":{"title":"Useful oracles for TTRPG","links":[],"tags":["boardgames"],"content":"\nJuice\nOne page Solo Engine (it has a companion Android app)\n"},"Gaming-and-boardgames/Videogame-roadmap-for-children":{"title":"Videogame roadmap for children","links":[],"tags":["videogames"],"content":"Videojuegos por edades\nLa edad adecuada para introducir a tu hijo a los videojuegos depende de su desarrollo y del tipo de juegos que elijas. Aquí tienes algunas pautas:\nDe 2 a 3 años\n\nOpciones: Juegos simples y educativos diseñados para tabletas o dispositivos táctiles.\nEjemplo: Juegos que enseñan colores, formas o vocabulario.\nObjetivo: Estimular habilidades motoras y cognitivas básicas.\n\nDe 4 a 6 años\n\nOpciones: Juegos más interactivos, como los que enseñan resolución de problemas o coordinación.\nEjemplo: Juegos como Lego Duplo World o Animal Crossing.\nObjetivo: Fomentar la creatividad y el aprendizaje sin presión.\n\nDe 7 años en adelante\n\nOpciones: Juegos familiares que introducen mecánicas más complejas, pero manteniendo un contenido apropiado.\nEjemplo: Mario Kart, Minecraft en modo creativo o Pokémon.\nObjetivo: Desarrollar habilidades estratégicas, trabajo en equipo y creatividad.\n\nConsideraciones\n\nControl parental: Supervisa el contenido y la cantidad de tiempo que juega.\nTiempo limitado: Asegúrate de equilibrar los videojuegos con otras actividades, como juegos al aire libre.\nJuega con ella: Es una forma fantástica de compartir tiempo y enseñarle valores como paciencia y trabajo en equipo.\n\nRoadmap\nHere’s a roadmap of video games your daughter can explore as the child grows, designed to match her developmental stages and interests. This plan emphasizes age-appropriate games that are fun, educational, and gradually introduce more complex gameplay mechanics.\n\nAges 3–5: Early Exploration\n\nFocus: Simple controls, bright visuals, forgiving gameplay, and creativity.\nPlatforms: Retro consoles, modern devices with kid-friendly options.\n\nSuggested Games:\n\nMario Paint (SNES)\n\nEncourages creativity with drawing and music creation.\n\n\nKirby’s Dream Land (Game Boy)\n\nA simple platformer with forgiving mechanics.\n\n\nPaw Patrol: Mighty Pups Save Adventure Bay (Modern Consoles)\n\nEasy, story-driven gameplay with beloved characters.\n\n\nSesame Street Games (Various Platforms)\n\nEducational games focused on letters, numbers, and basic problem-solving.\n\n\nLEGO Duplo World (Mobile/Tablets)\n\nEncourages creativity, problem-solving, and fun building.\n\n\n\n\nAges 6–8: Building Confidence\n\nFocus: Slightly more complex controls, puzzle-solving, and light storytelling.\nPlatforms: Modern consoles (Switch, PlayStation, Xbox), PC.\n\nSuggested Games:\n\nSuper Mario Odyssey (Switch)\n\nAn exploration-based platformer with a friendly difficulty curve.\n\n\nAnimal Crossing: New Horizons (Switch)\n\nIntroduces life simulation and creativity in a stress-free environment.\n\n\nMinecraft (Creative Mode) (Various Platforms)\n\nEncourages creativity, exploration, and basic problem-solving.\n\n\nLEGO Games (Various Platforms)\n\nFun cooperative play with light puzzles and platforming (e.g., LEGO Harry Potter, LEGO Star Wars).\n\n\nPokémon Sword/Shield (Switch)\n\nSimple turn-based RPG with exploration and collecting.\n\n\n\n\nAges 9–12: Developing Skills\n\nFocus: Strategy, teamwork, and slightly more challenging gameplay.\nPlatforms: Expanding to PC and advanced console games.\n\nSuggested Games:\n\nMario Kart 8 Deluxe (Switch)\n\nFun multiplayer with simple controls but enough challenge to improve skills.\n\n\nThe Legend of Zelda: Breath of the Wild (Switch)\n\nOpen-world exploration with problem-solving and light combat.\n\n\nSplatoon 3 (Switch)\n\nA kid-friendly introduction to online multiplayer shooters.\n\n\nMinecraft (Survival Mode) (Various Platforms)\n\nAdds strategy and resource management to the creative sandbox.\n\n\nStardew Valley (Various Platforms)\n\nIntroduces time management and life simulation mechanics.\n\n\n\n\nAges 13–15: Exploring Complex Gameplay\n\nFocus: Strategic thinking, narrative-driven games, and cooperative/competitive play.\nPlatforms: PC and consoles with access to broader libraries.\n\nSuggested Games:\n\nPortal 2 (PC/Consoles)\n\nA puzzle-platformer that challenges logic and creativity.\n\n\nThe Sims 4 (PC/Consoles)\n\nA life simulation game encouraging creativity and planning.\n\n\nHollow Knight (PC/Consoles)\n\nA beautifully challenging platformer with deep exploration.\n\n\nCivilization VI (PC/Consoles)\n\nStrategy and decision-making on a global scale.\n\n\nCo-op Games (Various Platforms)\n\nFun multiplayer games like Overcooked, Keep Talking and Nobody Explodes, or Human: Fall Flat.\n\n\n\n\nAges 16–18: Mastering Complex Games\n\nFocus: Narrative-driven experiences, advanced mechanics, and teamwork in competitive settings.\n\nSuggested Games:\n\nThe Witcher 3: Wild Hunt (PC/Consoles)\n\nA rich RPG with deep storytelling and complex choices.\n\n\nDark Souls or Elden Ring (PC/Consoles)\n\nChallenging games that reward patience and strategy.\n\n\nAmong Us (PC/Consoles)\n\nA social deduction game encouraging teamwork and critical thinking.\n\n\nFortnite or Valorant (PC/Consoles)\n\nCompetitive games to practice teamwork and fast reflexes.\n\n\nDisco Elysium (PC/Consoles)\n\nA mature RPG with philosophical storytelling for older teens.\n\n\n\n\nTips for the Roadmap\n\nFlexibility: Let her interests guide the journey. If she loves building, explore sandbox games; if storytelling fascinates her, look for narrative-driven games.\nCo-op Play: Play games together to encourage bonding and introduce her to new challenges in a supportive way.\nContent Awareness: Keep an eye on age ratings (ESRB/PEGI) and themes as she progresses to more mature games.\nEncourage Balance: Games are a tool for learning and entertainment but should be balanced with other hobbies and activities.\n\nThis roadmap allows her to grow her skills, interests, and love for gaming in a structured and enjoyable way.\nSNES and GB specific\nHere’s a curated list of kid-friendly games for the SNES and Game Boy that are fun, age-appropriate, and timelessly enjoyable:\n\nSNES\n\n\nSuper Mario World\n\nA classic platformer with vibrant worlds, simple controls, and delightful gameplay.\n\n\n\nThe Legend of Zelda: A Link to the Past\n\nA kid-friendly adventure filled with exploration, puzzles, and an engaging story.\n\n\n\nDonkey Kong Country\n\nBeautiful graphics, catchy music, and a challenging but fair platforming experience.\n\n\n\nKirby Super Star\n\nA variety-packed game with multiple modes, perfect for younger players.\n\n\n\nYoshi’s Island: Super Mario World 2\n\nA visually charming platformer with creative mechanics.\n\n\n\nDisney’s Aladdin\n\nA fun adaptation of the movie, with colorful graphics and accessible gameplay.\n\n\n\nSuper Bomberman 2\n\nSimple, fun, and great for multiplayer.\n\n\n\nPocky &amp; Rocky\n\nA cute and cooperative top-down adventure game.\n\n\n\nTiny Toon Adventures: Buster Busts Loose!\n\nA lighthearted platformer based on the popular animated series.\n\n\n\nSuper Turrican\n\nAction-packed, but still accessible for older kids.\n\n\n\n\nGame Boy\n\n\nPokémon Red/Blue/Yellow\n\nEasy to learn and endlessly engaging, perfect for introducing RPG mechanics to kids.\n\n\n\nKirby’s Dream Land\n\nA simple and forgiving platformer great for young children.\n\n\n\nTetris\n\nA timeless puzzle game that helps develop logical thinking.\n\n\n\nThe Legend of Zelda: Link’s Awakening\n\nA charming and kid-friendly introduction to adventure games.\n\n\n\nSuper Mario Land 2: 6 Golden Coins\n\nA fun and slightly easier Mario platformer.\n\n\n\nDonkey Kong (1994)\n\nA puzzle-platformer with clever mechanics.\n\n\n\nWario Land: Super Mario Land 3\n\nA quirky spin on platforming with lots of charm.\n\n\n\nMetroid II: Return of Samus\n\nSlightly more challenging, but rewarding for older kids.\n\n\n\nDisney’s DuckTales\n\nA light and fun platforming adventure.\n\n\n\nHarvest Moon GB\n\nA relaxing farming simulator that’s great for creativity and patience.\n\n\n\n\nThese games provide hours of fun while being accessible to kids in terms of difficulty and content."},"Learning/Productivity/Cómo-estudiar-libros-IT-de-manera-eficaz":{"title":"Cómo estudiar libros IT de manera eficaz","links":[],"tags":["productivity"],"content":"Estudiar un libro de IT de manera eficaz requiere un enfoque estructurado y práctico. Aquí te dejo algunos pasos que pueden ayudarte:\n\n\nLee el índice y la introducción: Esto te dará una idea general del contenido y de los temas clave. Establece tus expectativas y objetivos de aprendizaje desde el principio.\n\n\nDivide el contenido: Organiza el estudio en bloques manejables. Por ejemplo, puedes estudiar un capítulo o una sección cada día o semana, dependiendo de tu disponibilidad.\n\n\nTomar notas: Mientras lees, anota los conceptos importantes. Si te gusta escribir código, intenta hacer pequeños resúmenes en tu propio estilo. Usa diagramas, esquemas o mapas mentales para visualizar las relaciones entre los conceptos.\n\n\nPracticar lo aprendido: La programación y otras habilidades de IT son prácticas. Después de leer una sección, intenta aplicarla de inmediato, ya sea escribiendo código o configurando un entorno en tu máquina.\n\n\nHacer preguntas: Pregúntate qué conceptos no entiendes del todo. Investiga más allá del libro si es necesario. Los foros, la documentación oficial o incluso videos pueden complementar tu comprensión.\n\n\nRepetición espaciada: Revisa tus notas y repite los conceptos clave después de unos días. La repetición espaciada es muy eficaz para retener información a largo plazo.\n\n\nProyectos prácticos: Encuentra un proyecto en el que puedas aplicar lo que estás aprendiendo. Esto no solo consolida tu conocimiento, sino que te da una sensación de logro.\n\n\nDiscute y comparte: Hablar sobre lo que aprendes, o incluso enseñar a otros, refuerza tu comprensión. Considera participar en grupos de estudio o foros relacionados con IT.\n\n\nEn tu caso, con tu experiencia como ingeniero de software, probablemente ya aplicas algunos de estos métodos, pero quizás podrías ajustar la forma en que tomas notas o introduces proyectos más pequeños para probar nuevos conceptos rápidamente.\n¿Te gustaría probar hacer un mindmap sobre algún tema específico?"},"Learning/Productivity/Cómo-hacer-Mindmaps":{"title":"Mindmaps","links":[],"tags":["productivity"],"content":"Mind maps\nHacer un mindmap (o mapa mental) es un proceso visual y estructurado para organizar ideas y conceptos. Aquí te explico cómo crear uno paso a paso:\n\nDefine el tema central\n\n\nColoca el tema principal en el centro del mapa. Este será el concepto o idea general que quieres desarrollar.\nEjemplo: Si estás estudiando sobre Desarrollo Web, esa sería tu idea central.\n\n\n\nAñade ideas principales\n\nDibuja líneas o ramas desde el centro hacia afuera, y en cada rama escribe una idea clave relacionada con el tema central. Estas ideas principales serán los conceptos más amplios o categorías dentro del tema central.\nEjemplo para Desarrollo Web: HTML, CSS, JavaScript, Backend, Bases de datos.\n\n\n\nDesglosa las ideas secundarias\n\n\n\nA partir de cada idea principal, dibuja nuevas ramas para añadir subideas o conceptos relacionados. Puedes repetir este proceso tantas veces como sea necesario, creando ramas más pequeñas con detalles o explicaciones adicionales.\nEjemplo: Desde la rama de HTML, podrías añadir subramas como: “Etiquetas básicas”, “Semántica”, “Atributos”.\n\n\n\nUsa palabras clave\n\nMantén cada rama lo más simple posible. Usa palabras clave o frases cortas para que las ideas sean fáciles de recordar y conectar.\nEvita escribir párrafos largos en el mapa, lo importante es que sea visual y directo.\n\n\n\nAñade colores, íconos o imágenes\n\nUsa colores diferentes para las ramas principales, lo que ayuda a visualizar y recordar mejor la información.\nSi es útil, puedes añadir pequeños iconos o imágenes para representar ideas. Esto hace que el mapa sea más atractivo y fácil de entender de un vistazo.\n\n\n\nConecta conceptos relacionados\n\nSi hay ideas que están conectadas entre sí, pero están en diferentes ramas, puedes dibujar líneas o flechas entre ellas para mostrar las relaciones.\nEjemplo: Desde CSS, podrías conectar la subrama de “Flexbox” con JavaScript si quieres mostrar cómo el diseño y la interacción pueden estar vinculados.\n\n\n\nRevisa y ajusta\n\nUna vez terminado, revisa el mapa para asegurarte de que todo esté organizado de manera lógica. Si ves que alguna parte necesita más detalle, puedes agregar más ramas o reorganizar las existentes.\n\n\n\nEjemplo visual de un mindmap básico (Desarrollo Web):\n    [Desarrollo Web]\n        |\n        |-- [HTML]\n        |      |-- Etiquetas básicas\n        |      |-- Semántica\n        |      |-- Atributos\n        |\n        |-- [CSS]\n        |      |-- Selectores\n        |      |-- Flexbox\n        |      |-- Grid\n        |\n        |-- [JavaScript]\n        |      |-- DOM Manipulation\n        |      |-- Eventos\n        |      |-- Frameworks (React, Vue)\n        |\n        |-- [Backend]\n        |      |-- Node.js\n        |      |-- APIs\n        |\n        |-- [Bases de Datos]\n               |-- SQL\n               |-- NoSQL\n\nHerramientas recomendadas para crear mindmaps\n\nExcalidraw: Perfecto para hacer mapas mentales a mano alzada, de manera rápida y sencilla.\nMindMeister o Miro: Herramientas visuales más avanzadas si prefieres algo con más opciones de personalización.\nObsidianMD: Tiene plugins que te permiten hacer diagramas estilo mindmap dentro de tus notas.\n\nBeneficios de los mindmaps:\n\nFacilitan la organización de ideas de manera visual.\nAyudan a retener la información al asociar conceptos y palabras clave.\nSon perfectos para la planificación de proyectos y el aprendizaje, ya que te obligan a desglosar temas complejos en partes más manejables.\n"},"Learning/Productivity/Cómo-la-gente-real-procesa-notas":{"title":"Cómo la gente real procesa notas","links":["tags/flashcards"],"tags":["productivity","flashcards"],"content":"Vídeo de referencia: www.youtube.com/watch\nHoy en día hay mucha información desperdigada, y saber seleccionarla es importante\nNarrow the top of the information funnel\nDeclara bancarrota de inbox\nDeclara bancarrota de la bandeja de entrada de manera regular (básicamente, aprende a archivar o borrar aquellos mensajes que sabes que no vas a utilizar\nEn Obsidian podría guardar mensajes en una especie de carpeta llamada “inbox” y añadirle el tag #inbox para así poder filtrarlo fácilmente.\nTambién puedes hacer queries en una nota para almacenar algún patrón de query de esta manera para búsquedas que hagas muy a menudo:\ntag:#TIL\nTambién puedes utilizar dataview para ello:\nTABLE type, status, tags\nFROM #TIL \nLa función de visualización de grafo también puede ser muy útil para detectar nodos huérfanos y así encontrar nodos que podrías potencialmente vincular.\nOrdenar las notas que quieres procesar\nHaz una búsqueda como antes, ordénalo de más nuevo a más antiguo en los resultados (ya que quizás haya resultados que ya no sean relevantes pasados cierto tiempo).\nPermítete olvidar\nDate el lujo de ignorar ciertas cosas y liberar peso de tus notas en tu mente\nConclusión\nTomar notas tendría que ser un esfuerzo divertido! Si no te lo pasas bien, plantéate si estás tomando notas que estén relacionadas sobre lo que te interesa.\nFlashcards\nflashcards\nQué cosas puedes hacer para evitar la sobresaturación de información en tus notas, y consumir la información de forma que sea relevante?\n?\n\nSelecciona sólo fuentes que sean relevantes para ti. No quieras abarcar mucho\nDeclara la bancarrota del inbox, borra o archiva aquello que ya no sea relevante. Ayúdate de tags como #inbox para poder marcar la información pendiente de analizar, así como también poder buscarla\nPermítete olvidar aquello que ya no sea relevante o no necesites\n\n"},"Learning/Productivity/Cómo-tomar-notas-con-la-técnica-Cornell":{"title":"Cómo tomar notas con la técnica Cornell","links":["Learning/Productivity/Cómo-tomar-notas-de-manera-eficaz-mientras-estudias-un-libro"],"tags":["productivity"],"content":"Cómo funciona el método Cornell\nLa técnica Cornell es una técnica de sintetización de información y de toma de notas que consiste básicamente en que, cuando vas a tomar notas en clase sobre cualquier tema, dividas la hoja en cuatro partes de esta manera con líneas (suponiendo una hoja de tamaño A4):\n\nPasos para usar esta plantilla:\n\nAntes de empezar la clase, completa la sección del Título, donde escribirás el nombre del tema que vas a dar en clase, la asignatura, el profesor, fecha y número de hoja. Así podrás ubicar siempre esta hoja en un tiempo posterior\nDurante la clase, toma notas de la información más relevante en la sección de Nota de Clase. Ahí debes plasmar todo lo que te ayude a enteder mejor el tema: fechas, dibujos, frases… cualquier cosa que sea susceptible de salir en un examen\nTras finalizar la clase, debes rellenar el cuadro de Ideas Clave. En este apartado deberás escribir las preguntas, palabras o ideas que consideres claves del tema, así como dudas que te hayan surgido para poder preguntarlo luego\nPor último, rellena el cuadro Resumen, donde deberás sintetizar al máximo toda la información que hay en el resto de la hoja para que puedas hacer una composición de los aspectos más relevantes del tema con un simple vistazo\nPuedes usar tantas hojas como quieras si te quedas sin espacio, simplemente numera las hojas que uses\n\nA modo de resumen, éste es el esquema de qué va en cada sección de la página:\n\nVentajas\n\nPara tomar notas usando el método debes llevar una escucha activa durante la clase, y esto te permite asimilar mejor la información relevante\nEste método exige un repaso posterior a la clase para terminar de completar los apuntes y organizar la información. Esta acción te ayudará a consolidar mejor los conocimientos adquiridos\nEl método requiere algo más de trabajo y tiempo, pero es una inversión ya que lo que trabajes de más ahora, no lo tendrás que estudiar tanto luego\n\nCómo aplicar el método Cornell para estudiar\n\nDurante la lectura del tema, anota en la sección de Notas todos los puntos relevantes que estés abordando, de manera telegráfica\nFormula preguntas clave sobre las anotaciones y otros datos relevantes en la columna de Ideas Clave\nCubre con una hoja en blanco la sección de Notas, echa un vistazo a las preguntas del cuadro Ideas Clave e intenta responder a tus preguntas con tus propias palabras, exponiendo tu explicación sobre todos los puntos importantes\nRepasa, dedica al menos diez minutos semanales en revisar todos tus apuntes y resúmenes para mantener la información fresca\n\nCSS Para Obsidian\nPoner en .obsidian/snippets/cornell-notes.css, y activar la opción en Appearance\n.markdown-preview-view.cornell-note .callout[data-callout=&quot;info&quot;] {\n    float: right;\n    padding: 8px;\n    position: absolute;\n    left: 4%;\n    width: 20%;\n    max-width: 300px;\n    min-width: 150px;\n    max-height: 200px;\n    color: white;\n}\n \n.markdown-preview-view.cornell-note .callout[data-callout=&quot;info&quot;] .callout-icon {\n    display: none;\n}\n \n.markdown-preview-view.cornell-note .markdown-preview-sizer,\n.markdown-source-view.cornell-note .markdown-preview-sizer {\n    max-width: var(--file-line-width);\n    margin-left: auto;\n    margin-right: auto;\n    margin-inline: auto;\n    width: 100%;\n}\n \n.markdown-preview-view.cornell-note .callout[data-callout=&quot;summary&quot;] {\n    margin-top: 100px;\n}\n \nNotas Relacionadas\n\nCómo tomar notas de manera eficaz mientras estudias un libro\n\nReferencias\n\ndev.to/sanathks/highly-effective-cornell-notes-with-obsidian-6le\nwww.educalive.com/blog/metodo-cornell-tomar-apuntes\nmedium.com/obsidian-observer/from-paper-to-pixel-mastering-the-cornell-note-taking-method-in-the-digital-age-dae13ed83c29\n"},"Learning/Productivity/Cómo-tomar-notas-de-manera-eficaz-mientras-estudias-un-libro":{"title":"Cómo tomar notas de manera eficaz mientras estudias un libro","links":["Learning/Productivity/Cómo-tomar-notas-con-la-técnica-Cornell","Learning/Productivity/Cómo-hacer-Mindmaps"],"tags":["productivity"],"content":"Para tomar notas de manera eficaz mientras estudias un libro, puedes seguir estos pasos:\n1. Previsualiza y organiza\n\nAntes de empezar cada capítulo, revisa los títulos, subtítulos, y cualquier resumen o sección de conclusiones para captar la estructura.\nPiensa en lo que ya sabes sobre el tema y qué esperas aprender. Esto te ayudará a anticipar la información relevante.\n\n2. Usa un sistema de notas\n\nPuedes emplear un sistema como el método Cornell (dividir tu hoja en secciones para conceptos principales, notas, y un resumen final) o el método de mapas mentales para conectar ideas de forma visual.\nEscribe resúmenes en tus propias palabras: evitar copiar textualmente ayuda a procesar la información.\nClasifica las notas en categorías: como conceptos clave, dudas, y citas importantes. Esta organización ayuda en el repaso posterior.\n\n3. Subraya y anota en el libro\n\nUsa subrayado selectivo en vez de subrayar todo. Enfócate en palabras clave y frases que capturen la idea central.\nSi el libro es tuyo, puedes añadir notas marginales con preguntas o reflexiones rápidas para enriquecer la lectura.\n\n4. Haz pausas para reflexionar\n\nAl finalizar una sección o un capítulo, haz una pausa para reflexionar. Pregúntate qué has entendido y cómo podrías explicar esa información en tus propias palabras.\n\n5. Resume y revisa al final\n\nResume el capítulo en un par de párrafos. Esto te ayudará a consolidar el aprendizaje y te servirá como guía para revisar en el futuro.\nRevisa tus notas al finalizar la lectura para retener los conceptos clave.\n"},"Memes/SOLID-principles-with-penguins":{"title":"SOLID principles with penguins","links":[],"tags":["memes"],"content":"\n\n\n\n\n"},"My-CV":{"title":"CV","links":[],"tags":[],"content":"David Jiménez Martínez\nSenior Software Engineer, Python Developer\n⌨️ Github - 📚 Blog - 🌐 LinkedIn\n🔖 Summary\nSoftware Engineer with +10 years of experience in the full development cycle of complex applications across a variety of fields, leading the development of software projects from inception and mentoring technical teams.\nSpecialised in:\n\nDesigning and building software from the ground\nBackend development in both monolithic and distributed, event-driven systems\nEnsuring technical excellence and empowering teams to deliver high quality, maintainable solutions\n\n👨‍🏭 Working experience\n🖥️ DIGIT, a Scopely Studio (1 year, 8 months)\nSenior Backend Developer, 2023/03 - present\nContributed to the implementation of new features for DIGIT games\nHighlights:\n\nDeveloped new features for the game, ensuring performance through monitoring using Datadog and Kibana, and stress testing with Locust\nImproved code scaffolding and testing practices for greater efficiency\nImproved code quality and consistency with mypy\nHosted technical trainings\n\n\n🖥️ Inari.io (4 years 9 months)\nBackend Architect, 2022/03 - 2023/03\nLed the technical development, testing and packaging of new platform features and proofs of concept, delivering new content to the product suites of Inari.\nPython Lead Engineer and Tech Coach, 2018/07 - 2022/03\nLed and mentored a cross-functional team of five developers.\nHighlights:\n\nDesigned, built and deployed a highly scalable, distributed policy admin platform, based on CQRS+ES/Clean architecture within a microservices ecosystem, following Domain Driven Design (DDD) best practices and patterns\nImplemented a retry/DLQ framework to use with Apache Kafka, greatly improving the performance over SQS\nEventual consistency for complex transactions achieved via choreography (event-driven) and orchestration (Taskflow)\nAll functionality was exposed and secured via a GraphQL API\nDesigned and implemented a library to abstract Blockchain to serve as an append-only event store\nDesigned and implemented a high-performance RBAC + ABAC auth system based on pathfinding, improving the performance of existing authorisation python libraries like Casbin\nTrained and mentored junior developers to bring them up to speed\n\n\n🖥️ Self-employed (5 years 4 months)\nMelange, 2017/10 - 2023/01\nDeveloper and maintainer of Melange, an open-source library aiming to ease the creation of Event-driven architectures with Python. Adopted at 21Buttons and Inari.io. Out of maintenance in favor of Kafka.\n\ngithub.com/Rydra/melange\n\n\n🖥️ 21Buttons (1 year)\nPython Architect and Developer, 2017/07 - 2018/07\nContributed to the implementation of new features for the 21Buttons fashion social network app, and led the development of a Marketplace platform.\nHighlights:\n\nLed the Introduction of good testing practices and DDD patterns into the project\nImproved the existing Django solution by structuring the code to follow the Hexagonal Architecture, decoupling the framework from the business logic\n\n\n🖥️ Vistaprint (11 months)\n.NET / C# Software Engineer, 2016/09 - 2017/08\nContributed to the maintenance of their website by developing new features to enhance SEO.\nHighlights:\n\nImproved existing features and added new API entrypoints using .NET and .NET Core, TDD with NUnit, deployed the solution using Terraform and Docker, all hosted in AWS\n\n\n🖥️ Tokiota (1 year 7 months)\nSenior .NET and Javascript Engineer, 2015/01 - 2016/07\nContributed as a consultant to the development of several projects:\n\nAn XML engine for processing employee data and generating payslips, as well as an internal administration tool in the context of a SCRUM team composed of seven members\nAn e-Commerce platform to sell football subscriptions in a team of three people\n\nHighlights:\n\nImplemented complex backend algorithms and designed the architecture of the project, decoupling NHibernate persistence from the business logic\nEncouraged DDD, TDD and design patterns best practices within the team\nImplemented a distributed software solution using Azure Service Fabric\n\n\n🖥️ King-eClient (1 year 1 month)\n.NET Lead Developer, 2014/01 - 2015/01\nContributed as a consultant to the development efforts of two projects, an e-Commerce platform for a pharma company, and a mobile application for a public transportation company.\nHighlights:\n\nDesigned and implemented the e-Commerce platform from inception using the ASP.NET technologies\nDesigned and implemented the mobile application from inception using Xamarin\n\n\n🖥️ Good Deal (1 year 1 month)\nAssociate .NET Developer, 2013/01 - 2014/01\nContributed to the development of new features for a software product targeted at retailers to deliver coupons to customers, based on their purchases and their profile, aiming to increase fidelisation and satisfaction.\n\n🖥️ Sant Celoni Town Hall\n.NET developer freelancer, 2011/06 - 2012/01\nLed a technical team of three member to develop a small e-Government platform to handle several types of form applications from citizens with ASP.NET.\n\n🖥️ Universitat Politècnica de Catalunya (1 year 8 months)\nDeveloper intern, 2008/07 - 2010/02\nContributed to the development of new features for the educational platform Moodle. Developed frontend features with PHP, HTML and CSS.\n⚙️ Technical Skills\nProgramming Skills\n\nAlgorithms and problem-solving mindset\nSOLID principles\nArchitectural patterns: Clean Architecture, CQRS + Event Sourcing, Event-driven, MVP\nTesting: Unit, Integration and End to End\nProgramming Paradigms: Domain-Driven Design, Object-Oriented Programming, Functional Programming\n\nBackend Technologies\n\nLanguages: Python, Javascript, C#, F#\nAsynchronous Frameworks: asyncio / anyio, Celery, Redis pubsub, Apache Kafka\nDatabases: PostgresSQL, Redis, Elasticsearch, Blockchain\nLocal environment development with containerized environments: Docker, Docker Compose\nWeb Frameworks: Django Rest Framework, Flask, FastAPI\nCloud providers: AWS, Heroku\n\n📖 Education &amp; Qualifications\nUniversitat Politècnica de Catalunya (UPC)\nMaster in Computing, Software Engineering, Information Systems and Databases, 2011 - 2013\nSpecialisation in software engineering principles, design patterns and database management\nUniversitat Politècnica de Catalunya (UPC)\nTechnical Engineer in Computing Management, 2006 - 2009\n📖 Trainings and Certifications\nCommunicating with Diplomacy and Tact, 2024/03\nLinkedIn\nEffective communication strategies for multicultural teams\nPeopleware, Agile Teams and Management 3.0, 03/2023\n233 Academy\nPractices and techniques to create autonomous teams\nData Science and Machine Learning with Python - Hands On!, 2016/09\nUdemy\nDeep dive into the implementation of ML-powered python applications\nMachine Learning, 2016/09\nCoursera\nIntroduction to the concepts of machine learning, classification algorithms and recommendation systems\nMisc. Skills\n👅 Languages\nMother tongue: Catalan, Spanish\nOther languages:\n\nEnglish: Fluent, Cambridge First Certificate (B2)\n\n🕹️ Hobbies\n\nBoard games (chess, LOTR LCG, card games and strategy games in general)\nVideo games\nSports (gym, hiking, long walks)\nLearning new tech that can be used in my daily job\nA good tea with a good conversation topic\n"},"Recetas/Caldo-corto":{"title":"Caldo corto","links":[],"tags":["receta"],"content":"El caldo corto es un líquido aromatizado que se utiliza principalmente para cocinar pescados, mariscos y, en ocasiones, carnes o verduras de manera rápida. Su propósito principal es realzar el sabor de los alimentos y mantener su textura y frescura. Es muy común en la cocina clásica francesa y mediterránea.\nIngredientes típicos de un caldo corto:\n\nAgua: Es la base.\nHierbas y especias: Como laurel, tomillo, perejil o pimienta en grano.\nVerduras: Generalmente cebolla, zanahoria, apio o puerro.\nVino blanco o vinagre: Aporta acidez y realza los sabores.\nSal: Para sazonar el caldo.\n\nPreparación básica:\n\nSe hierve agua con las verduras, hierbas y especias.\nSe añade vino blanco o vinagre para darle acidez.\nSe cocina durante unos 20-30 minutos para extraer los sabores de los ingredientes.\nLuego, se cuela y se utiliza el líquido para pochar el alimento deseado.\n"},"Recetas/Cocer-lentejar":{"title":"Cocer lentejar","links":[],"tags":["receta"],"content":"Cocer lentejas en una olla a presión es rápido y sencillo. Aquí tienes los pasos:\nIngredientes básicos\n\n250 g de lentejas (puedes usar pardinas, castellanas o las que prefieras).\n750 ml de agua o caldo (aproximadamente el triple del volumen de las lentejas).\n1 hoja de laurel (opcional).\nSal al gusto (añádela al final para que las lentejas no se endurezcan).\nIngredientes opcionales: zanahoria, cebolla, ajo, patata, pimiento, chorizo, etc.\n\nPasos a seguir\n\n\nPreparar las lentejas\n\nSi usas lentejas grandes, remójalas en agua fría durante 1-2 horas para acelerar la cocción (las pardinas no necesitan remojo).\nEnjuágalas bien antes de usarlas.\n\n\n\nSofrito opcional\n\nSi deseas más sabor, sofríe cebolla, ajo y/o pimientos con un poco de aceite en la olla a presión antes de añadir las lentejas.\n\n\n\nAñadir lentejas y líquido\n\nColoca las lentejas en la olla junto con el agua o caldo.\nAgrega la hoja de laurel, las verduras y condimentos que prefieras (excepto la sal).\n\n\n\nCerrar y cocinar\n\nCierra la olla a presión correctamente y ponla a fuego alto.\nCuando la olla alcance la presión (empiece a sonar o soltar vapor, según tu modelo), reduce el fuego a medio-bajo.\n\n\n\nTiempo de cocción\n\nCocina durante 10-12 minutos si son lentejas pardinas o pequeñas.\nPara lentejas más grandes, cocina unos 15-20 minutos.\n\n\n\nAbrir la olla\n\nApaga el fuego y deja que la presión disminuya por sí sola (método natural) o usa el sistema de liberación rápida de tu olla (consulta el manual).\nUna vez que la olla se pueda abrir, prueba las lentejas.\n\n\n\nAjustar el sabor\n\nAñade sal al gusto y remueve. Si necesitas espesar el caldo, cocina a fuego lento sin tapa por unos minutos.\n\n\n\n¡Listas para servir! Puedes acompañarlas con arroz, pan o simplemente disfrutar de un buen guiso."},"Recetas/Croquetas-de-coliflor-con-bechamel":{"title":"Croquetas de coliflor con bechamel","links":[],"tags":["receta"],"content":"Añadir bechamel a las croquetas de coliflor es una excelente idea, ya que les da una textura cremosa y las hace más jugosas. Aquí te explico cómo incorporarla:\nReceta de croquetas de coliflor con bechamel:\nIngredientes:\n\n1 coliflor mediana (500 g aprox.)\n2 cucharadas de mantequilla o aceite de oliva\n2 cucharadas de harina\n250 ml de leche (puede ser vegetal si prefieres)\nSal, pimienta y nuez moscada al gusto\n50 g de queso rallado (opcional)\nPan rallado (para rebozar, opcional)\nAceite (para freír o hornear)\n\n\nInstrucciones:\n\n\nPreparar la coliflor:\n\nCocina la coliflor en agua hirviendo con sal hasta que esté tierna (10-12 minutos). Escurre bien y tritúrala con un tenedor o procesador.\n\n\n\nHacer la bechamel:\n\nEn una sartén, derrite la mantequilla (o calienta el aceite) y añade la harina. Remueve bien para evitar grumos.\nAgrega la leche poco a poco, sin dejar de remover, hasta que la mezcla espese.\nSazona con sal, pimienta y nuez moscada al gusto.\nSi quieres, añade el queso rallado y mezcla hasta que se derrita.\n\n\n\nMezclar la coliflor con la bechamel:\n\nIncorpora la coliflor triturada a la bechamel y mezcla bien hasta obtener una masa homogénea y espesa.\nDeja enfriar la mezcla en la nevera durante al menos 1 hora (o hasta que esté firme).\n\n\n\nFormar y rebozar las croquetas:\n\nCon las manos, forma bolitas o croquetas.\nSi lo deseas, pásalas por pan rallado para darles una capa crujiente.\n\n\n\nCocinar:\n\nFreír: En una sartén con aceite caliente, fríe las croquetas hasta que estén doradas.\nHornear: Colócalas en una bandeja con papel vegetal, rocía con un poco de aceite y hornea a 200°C durante 20-25 minutos.\n\n\n\n\nConsejos:\n\nSi la mezcla queda muy líquida, añade un poco más de pan rallado o queso rallado para espesarla.\nLa bechamel le da un toque cremoso y tradicional a las croquetas, pero si prefieres una versión más ligera, puedes omitirla.\n\n¡Espero que disfrutes estas croquetas de coliflor con bechamel! 😊"},"Recetas/Falafel":{"title":"Falafel","links":[],"tags":["receta"],"content":"El falafel es una deliciosa receta de origen mediterráneo hecha a base de garbanzos. Aquí tienes cómo prepararlo paso a paso:\nIngredientes\n\n300 g de garbanzos secos (remojados en agua durante al menos 12 horas)\n1 cebolla mediana, picada\n2-3 dientes de ajo\n1 puñado de perejil fresco (o cilantro, al gusto)\n1/2 cucharadita de comino molido\n1/2 cucharadita de cilantro molido\n1/4 cucharadita de pimienta negra\n1/2 cucharadita de sal (al gusto)\n1/4 cucharadita de bicarbonato de sodio (opcional, para mejorar la textura)\n2-3 cucharadas de harina de garbanzo o pan rallado (si es necesario)\nAceite vegetal para freír\n\n\nPreparación\n\n\nPreparar los garbanzos:\nEscurre y enjuaga los garbanzos remojados. No se cocinan previamente, ya que se usarán crudos.\n\n\nMezclar los ingredientes:\nColoca los garbanzos, cebolla, ajo, perejil, especias y bicarbonato en un procesador de alimentos. Tritura hasta obtener una mezcla homogénea pero con textura, no debe convertirse en puré.\n\n\nAjustar la consistencia:\nSi la mezcla está muy húmeda y no se compacta bien, añade harina de garbanzo o pan rallado poco a poco hasta obtener una masa que puedas moldear.\n\n\nRefrigerar la masa:\nDeja la mezcla en la nevera durante al menos 30 minutos. Esto ayuda a que sea más fácil de manejar.\n\n\nFormar las bolitas:\nForma pequeñas bolitas o discos con la mezcla, presionando ligeramente para compactarlas.\n\n\nFreír los falafel:\nCalienta abundante aceite en una sartén o freidora (a unos 180°C). Fríe los falafel en pequeñas tandas hasta que estén dorados y crujientes por fuera, unos 3-4 minutos.\n\n\nEscurrir:\nRetira los falafel y colócalos sobre papel absorbente para eliminar el exceso de aceite.\n\n\n\nSugerencias de presentación\n\nSírvelos con pan pita, ensalada, y salsa tahini o yogur.\nTambién puedes añadirlos a un bol de vegetales frescos para una opción más ligera.\n\n¿Te animas a intentarlo?"},"Recetas/Flan-de-naranja":{"title":"Flan de naranja","links":[],"tags":["recetas"],"content":"Aquí tienes una receta sencilla para preparar un delicioso flan de naranja:\nIngredientes\n\n500 ml de leche entera\n4 huevos grandes\n150 g de azúcar (puedes ajustar según tu preferencia)\nRalladura de una naranja (preferiblemente ecológica)\n100 ml de zumo de naranja natural\nPara el caramelo:\n\n100 g de azúcar\n2 cucharadas de agua\n\n\n\n\nPreparación\n\n\nPrepara el caramelo:\n\nEn un cazo a fuego medio, coloca el azúcar y el agua. Cocina sin remover hasta que el azúcar se derrita y tome un color dorado (ten cuidado de no quemarlo).\nVierte rápidamente el caramelo en el fondo de los moldes individuales o un molde grande y repártelo de manera uniforme. Reserva.\n\n\n\nPrepara la mezcla del flan:\n\nEn un bol, bate los huevos con el azúcar hasta que estén bien integrados.\nAñade la ralladura de naranja y el zumo, mezclando bien.\nIncorpora la leche poco a poco mientras sigues batiendo suavemente para evitar formar burbujas.\n\n\n\nLlena los moldes:\n\nVierte la mezcla en los moldes caramelizados, llenándolos casi hasta el borde.\n\n\n\nCocción al baño maría:\n\nPrecalienta el horno a 160 °C.\nColoca los moldes en una bandeja honda y llena la bandeja con agua caliente hasta alcanzar la mitad de la altura de los moldes.\nHornea durante 40-50 minutos (o hasta que al insertar un palillo en el centro, este salga limpio).\n\n\n\nEnfría y desmolda:\n\nDeja que los flanes se enfríen a temperatura ambiente y luego refrigéralos durante al menos 4 horas o hasta que estén bien fríos.\nPasa un cuchillo por el borde del molde y desmóldalos con cuidado en un plato.\n\n\n\n\nConsejos:\n\nPuedes acompañar el flan con nata montada o trocitos de naranja confitada.\nSi prefieres un flan más cremoso, sustituye parte de la leche por nata.\n\n¡Disfrútalo!"},"Recetas/Galletas-de-avena-y-crema-de-cacahuete":{"title":"Galletas de avena y crema de cacahuete","links":[],"tags":["receta"],"content":"¡Claro! Aquí tienes la receta con las medidas en gramos y mililitros. A partir de ahora, te daré las medidas en gramos o mililitros para mayor precisión. 😊\nIngredientes:\n\n100 g de avena tradicional (copos de avena)\n120 g de crema de cacahuete (mantequilla de maní)\n85 g de miel o sirope de arce (aproximadamente 60 ml)\n40 g de chispas de chocolate (o más al gusto)\n5 ml de esencia de vainilla (1 cucharadita, opcional)\nUna pizca de sal (opcional, resalta el sabor)\n\nInstrucciones:\n\n\nMezcla los ingredientes: En un tazón grande, combina la avena, la crema de cacahuete, la miel (o sirope de arce), las chispas de chocolate, la vainilla y la sal. Mezcla bien hasta que todos los ingredientes estén integrados.\n\n\nForma las bolitas: Con las manos limpias, toma porciones de la mezcla y forma bolitas del tamaño que prefieras (aproximadamente del tamaño de una nuez).\n\n\nEnfría: Coloca las bolitas en una bandeja o plato y refrigéralas durante al menos 30 minutos para que se firmen.\n\n\nSirve y disfruta: Una vez frías, ¡están listas para comer! Puedes guardarlas en un recipiente hermético en la nevera durante varios días.\n\n\nConsejos:\n\nSi la mezcla está muy seca, añade un poco más de crema de cacahuete o miel.\nSi prefieres un toque crujiente, puedes añadir coco rallado o trocitos de nueces.\nEstas bolitas son ideales como snack saludable o postre rápido.\n\n¡Espero que las disfrutes! 😊"},"Recetas/Galletas-de-avena":{"title":"Galletas de avena","links":[],"tags":["receta"],"content":"¡Gracias por probar la receta! Es normal que las galletas de avena y plátano queden un poco densas o gomosas si no se ajustan bien las proporciones o el tiempo de horneado. Aquí tienes algunos consejos para mejorar la textura:\n\nPosibles causas y soluciones:\n\n\nExceso de avena:\n\nSi añades demasiada avena, la masa puede quedar seca y las galletas duras.\nSolución: Reduce la cantidad de avena a 80 g y ve añadiendo más si la masa está demasiado líquida. La mezcla debe ser espesa pero manejable.\n\n\n\nPlátanos pequeños o poco maduros:\n\nSi los plátanos no están lo suficientemente maduros, no aportarán suficiente dulzor ni humedad.\nSolución: Usa plátanos muy maduros (con manchas oscuras) y asegúrate de que el peso total sea de al menos 200 g.\n\n\n\nHorneado insuficiente o excesivo:\n\nSi las galletas no se hornean lo suficiente, pueden quedar gomosas. Si se hornean demasiado, se secan y endurecen.\nSolución: Ajusta el tiempo de horneado. Prueba hornearlas 12-15 minutos si las prefieres más tiernas, o 18-20 minutos si las prefieres más crujientes. Vigílalas para evitar que se sequen demasiado.\n\n\n\nFalta de líquido o grasa:\n\nEsta receta no lleva aceite ni mantequilla, por lo que puede quedar seca si no se equilibra bien.\nSolución: Añade 1-2 cucharadas (15-30 ml) de aceite de coco, mantequilla derretida o yogur natural para darles más humedad.\n\n\n\nAlmacenamiento:\n\nSi las galletas se guardan en un recipiente hermético mientras aún están calientes, pueden volverse gomosas.\nSolución: Déjalas enfriar completamente antes de guardarlas. Guárdalas en un recipiente hermético a temperatura ambiente o en la nevera si hace mucho calor.\n\n\n\n\nVersión mejorada de la receta (para evitar que queden duras o gomosas):\nIngredientes:\n\n2 plátanos maduros (200-250 g)\n80 g de avena\n1 cucharadita de canela (5 g)\n1 cucharadita de esencia de vainilla (5 ml)\n1-2 cucharadas de miel o sirope de arce (15-30 g)\n1-2 cucharadas de aceite de coco o mantequilla derretida (15-30 ml)\nOpcional: 30 g de chispas de chocolate, nueces o pasas.\n\nInstrucciones:\n\nPrecalienta el horno a 180°C (350°F).\nTritura los plátanos en un tazón hasta que queden cremosos.\nAñade la avena, canela, vainilla, miel y aceite de coco. Mezcla bien.\nSi la masa está muy líquida, añade un poco más de avena (10-20 g). Debe quedar espesa pero no seca.\nForma las galletas y colócalas en una bandeja con papel pergamino.\nHornea durante 15-18 minutos (dependiendo de tu horno). Las galletas deben estar doradas en los bordes pero aún blandas en el centro.\nDéjalas enfriar completamente antes de guardarlas.\n\n\nCon estos ajustes, las galletas deberían quedar más tiernas y menos gomosas. ¡Déjame saber cómo te va! 😊"},"Recetas/Galletas-de-chocolate":{"title":"Galletas de chocolate","links":[],"tags":["receta"],"content":"Claro! El rustido de pollo es un plato clásico de la cocina catalana, perfecto para una comida reconfortante. Aquí tienes una receta básica para prepararlo:\nIngredientes:\n\n1 huevo a temperatura ambiente\n100g mantequilla a temperatura ambiente\n75g azúcar blanco\n100g azúcar moreno\n200g harina\n2g levadura\n150g choco chips\n3g sal\n1 cucharada de vainilla\n\nPreparación:\n\nMezcla el azúcar, la mantequilla y el huevo con una batidora de amasar hasta que esté todo integrado, aunque no tiene por qué ser del todo uniforme\nAñadir la harina, levadura y sal, e integrar con la batidora\nSigue amasando, pero esta vez con las manos limpias para que quede bien homogénea la masa\nAñade las pepitas de chocolate y sigue amasando\nHaz bolitas pequeñas de para cada galleta. Mójate un poco las manos para que sea más fácil hacer las bolitas.\nHornea en la airfryer en modo “bake” a 165 grados y 15-17 min.\n"},"Recetas/Hamburguesas-vegetales":{"title":"Hamburguesas vegetales","links":[],"tags":["recetas"],"content":"Claro, aquí tienes la receta con las cantidades en gramos, aproximadamente para 4 hamburguesas medianas:\nIngredientes\n\n200 g de legumbres cocidas (lentejas, garbanzos o frijoles)\n50 g de avena en hojuelas o pan rallado\n1 huevo (aproximadamente 50 g)\n50 g de zanahoria rallada (u otra verdura rallada)\n30 g de cebolla picada finamente\n1 diente de ajo picado (opcional)\n1 cucharadita de comino o pimentón (aproximadamente 2-3 g)\nSal y pimienta al gusto\nAceite de oliva para cocinar (unos 15 ml)\n\nInstrucciones\n\n\nPreparar la mezcla: Tritura las legumbres cocidas en un bol hasta lograr una textura más o menos homogénea.\n\n\nAgregar el resto de ingredientes: Añade la avena o pan rallado, el huevo, la zanahoria, la cebolla, el ajo (opcional), el comino, sal y pimienta. Mezcla bien hasta que todo esté integrado.\n\n\nDejar reposar: Refrigera la mezcla durante unos 15-20 minutos para ayudar a que tome más consistencia.\n\n\nFormar las hamburguesas: Divide la mezcla en 4 porciones y forma las hamburguesas con las manos.\n\n\nCocinar: En una sartén con un poco de aceite de oliva, cocina las hamburguesas a fuego medio durante unos 3-4 minutos por cada lado hasta que estén doradas.\n\n\nConsejos\nSi quieres una consistencia aún más firme, añade unos 20-30 g adicionales de pan rallado o avena, o una cucharada de harina regular o de garbanzo.\nCosas que he tenido que hacer\n\nSi lo haces con lentejas, pueden absorber bastante agua. Hay que asegurarse que la masa quede bastante espesa para que se pueda trabajar, ya sea echando más harina o pan rallado. Hay que dejar también la mezcla en la nevera para que se endurezca un poco.\n"},"Recetas/Hamburgusas-de-carne":{"title":"Mis propias hamburgusas","links":[],"tags":["recetas"],"content":"Hacer tus propias hamburguesas en casa con carne picada es sencillo y te permite personalizar el sabor y la textura. Aquí tienes una receta básica y algunos consejos:\nIngredientes\n\n500 g de carne picada (puede ser de ternera, cerdo o mezcla)\n1 huevo (opcional, ayuda a compactar la carne)\n1/2 cebolla pequeña finamente picada (opcional)\n1 diente de ajo picado o en polvo (opcional)\nSal y pimienta al gusto\nPan rallado para mejorar la textura\nOpcionales: perejil fresco picado, mostaza, salsa Worcestershire\n\nInstrucciones\n\n\nPreparar la mezcla de carne:\n\nColoca la carne picada en un bol grande. Agrega la sal, la pimienta, el ajo, la cebolla y otros ingredientes opcionales que desees.\nAñade el huevo si quieres una mezcla más compacta, aunque no es imprescindible.\n\n\n\nMezclar los ingredientes:\n\nUsa tus manos (limpias) para mezclar bien los ingredientes, pero sin sobretrabajar la carne, para que no quede dura.\n\n\n\nFormar las hamburguesas:\n\nDivide la mezcla en porciones iguales (por ejemplo, 4 hamburguesas de unos 125 g cada una).\nDale forma de bola primero, luego aplástalas para darles la forma de hamburguesa, de aproximadamente 1.5 cm de grosor. Puedes hacerles un pequeño hueco en el centro con el pulgar para que mantengan su forma al cocinarse.\n\n\n\nCocinar las hamburguesas:\n\nCalienta una sartén, parrilla o plancha a fuego medio-alto y unta ligeramente con aceite.\nCocina las hamburguesas unos 4-5 minutos por lado para un término medio, o hasta que alcancen el punto que prefieras. Evita presionarlas con la espátula para que no pierdan jugos.\n\n\n\nServir:\n\nSirve en panecillos con los ingredientes que te gusten: queso, lechuga, tomate, cebolla caramelizada, pepinillos, etc.\n\n\n\n¡Listo! Ahora puedes disfrutar de tus hamburguesas caseras."},"Recetas/Hummus":{"title":"Hummus","links":[],"tags":["receta"],"content":"Aquí tienes una receta sencilla y deliciosa para hacer hummus casero:\nIngredientes:\n\n400 g de garbanzos cocidos (pueden ser de bote, bien enjuagados y escurridos).\n1 diente de ajo.\n2-3 cucharadas de tahini (pasta de sésamo).\nJugo de medio limón (o al gusto).\n3-4 cucharadas de aceite de oliva virgen extra.\n1/2 cucharadita de comino en polvo (opcional).\nSal al gusto.\nAgua fría (para ajustar la textura).\nPimentón dulce o picante (para decorar).\nUn chorrito extra de aceite de oliva y unos garbanzos enteros para decorar (opcional).\n\n\nInstrucciones:\n\n\nPreparar los garbanzos: Si usas garbanzos cocidos de bote, enjuágalos bien bajo agua fría para eliminar el sabor del líquido de conservación. Si son caseros, asegúrate de que estén bien cocidos.\n\n\nMezclar los ingredientes: En un procesador de alimentos o licuadora, coloca los garbanzos, el ajo pelado, el tahini, el jugo de limón, el comino, la sal y el aceite de oliva.\n\n\nAjustar la textura: Tritura todo hasta obtener una mezcla cremosa. Si está demasiado espesa, añade agua fría poco a poco mientras sigues mezclando hasta alcanzar la textura deseada.\n\n\nProbar y ajustar: Prueba el hummus y ajusta la sal, el limón o el tahini según tu gusto.\n\n\nServir: Coloca el hummus en un bol, haz un pequeño hueco en el centro, añade un chorrito de aceite de oliva, espolvorea un poco de pimentón y decora con unos garbanzos enteros si lo deseas.\n\n\n\nSugerencias de acompañamiento:\n\nPan de pita.\nBastones de zanahoria, pepino o apio.\nChips de pan o crackers.\nComo acompañamiento para ensaladas o falafel.\n\n¡Disfrútalo!"},"Recetas/Masa-de-pizza":{"title":"Masa de pizza","links":[],"tags":["recetas"],"content":"Ingredientes\n\nPor persona:\n\n100g harina\n50ml agua\nun poco de masa madre\n1/2 cucharada de aceite de oliva\nsal\n\n\n\nPreparación\n\nAmasar todo y dejar reposar unas cuantas horas (mejor del día anterior). Dejar tapado en un bol\nPrecocinar la masa previamente durante unos 5 minutos en el horno precalentado a 180, pero cuidado de que no se haga demasiado y cruja!\n"},"Recetas/Merluza-al-horno":{"title":"Merluza al horno","links":[],"tags":["receta"],"content":"Aquí tienes una receta sencilla para preparar merluza al horno con cama de patatas y cebolla:\nIngredientes (para 4 personas):\n\n4 lomos o rodajas de merluza\n3 patatas medianas\n2 cebollas\n2 dientes de ajo\n1 pimiento verde (opcional)\n1 vaso de vino blanco\n1/2 vaso de caldo de pescado (o agua)\nAceite de oliva virgen extra\nSal y pimienta al gusto\nPerejil fresco para decorar\nRodajas de limón (opcional)\n\nInstrucciones:\n\n\nPrecalentar el horno\n\nPrecalienta el horno a 200°C (calor arriba y abajo).\n\n\n\nPreparar las patatas y cebolla\n\nPela las patatas y córtalas en rodajas finas (de 0.5 cm aprox.).\nCorta las cebollas en juliana.\nSi usas pimiento, córtalo en tiras finas.\n\n\n\nMontar la base\n\nEngrasa con aceite una bandeja de horno.\nColoca las patatas en la base, formando una cama. Encima, distribuye la cebolla y el pimiento.\nSalpimienta al gusto y riega con un chorrito de aceite de oliva.\n\n\n\nCocinar las verduras\n\nIntroduce la bandeja en el horno durante 15-20 minutos para que las patatas y la cebolla se ablanden un poco.\n\n\n\nAñadir la merluza\n\nSaca la bandeja del horno. Coloca los lomos o rodajas de merluza sobre las verduras.\nEn un mortero, machaca los ajos con un poco de perejil picado y mezcla con el vino blanco y el caldo de pescado.\nVierte esta mezcla por encima de la merluza y las verduras.\n\n\n\nHornear todo junto\n\nHornea durante 15-20 minutos más, dependiendo del grosor de la merluza.\nSi quieres un toque dorado, puedes gratinar los últimos 5 minutos.\n\n\n\nServir\n\nSaca del horno y decora con perejil fresco picado y rodajas de limón si lo deseas.\nSirve caliente acompañado de una ensalada o un poco de pan para mojar en la salsa.\n\n\n\n¡Disfruta de este plato saludable y delicioso!"},"Recetas/Overnight-Oats":{"title":"Overnight Oats","links":[],"tags":["receta"],"content":"Here’s a simple and delicious recipe for overnight oats:\nIngredients:\n\n1/2 cup (50g) rolled oats\n1/2 cup (120ml) milk of choice (e.g., cow’s milk, almond milk, oat milk)\n1/4 cup (60g) plain Greek yogurt (optional, for creaminess)\n1 tsp chia seeds (optional, for extra fiber and omega-3s)\n1/2 tsp vanilla extract\n1-2 tsp honey or maple syrup (optional, for sweetness)\nToppings: fresh fruit, nuts, seeds, or nut butter\n\n\nInstructions:\n\nIn a jar or container, combine oats, milk, yogurt, chia seeds, vanilla extract, and sweetener (if using).\nStir well to ensure everything is mixed thoroughly.\nSeal the jar/container and refrigerate overnight (or at least 4-6 hours).\nIn the morning, give it a stir and add your favorite toppings (e.g., sliced bananas, berries, chopped nuts, or a drizzle of nut butter).\nEnjoy cold, or heat it in the microwave for 30-60 seconds if you prefer it warm.\n\nFeel free to experiment with flavors by adding cocoa powder, cinnamon, or mashed banana to the base mixture!"},"Recetas/Pollo-a-la-parrilla":{"title":"Pollo a la parrilla","links":[],"tags":["receta"],"content":"Aquí tienes una receta básica para preparar un delicioso pollo a la parrilla:\nIngredientes\n\n1 kg de pollo (muslos, pechugas, alitas, o una mezcla)\n3 dientes de ajo (picados o triturados)\n1 limón (zumo y ralladura)\n3 cucharadas de aceite de oliva\n1 cucharadita de pimentón dulce o picante (según prefieras)\n1 cucharadita de comino en polvo\n1 ramita de romero fresco (o 1 cucharadita seco)\nSal y pimienta al gusto\n\nInstrucciones\n\n\nPreparar el adobo:\nEn un bol grande, mezcla el ajo, el zumo y la ralladura de limón, el aceite de oliva, el pimentón, el comino, el romero, sal y pimienta.\n\n\nMarinar el pollo:\nAñade las piezas de pollo al bol y mezcla bien, asegurándote de que cada pieza quede cubierta con el adobo. Tapa el bol y deja marinar en la nevera durante al menos 1 hora (mejor si es toda la noche).\n\n\nPrecalentar la parrilla:\nCalienta la parrilla a fuego medio-alto. Si usas una parrilla de carbón, asegúrate de que las brasas estén bien distribuidas y calientes.\n\n\nCocinar el pollo:\nColoca las piezas de pollo en la parrilla. Cocina durante unos 6-8 minutos por lado, dependiendo del grosor, o hasta que estén bien doradas por fuera y completamente cocidas por dentro (la temperatura interna debe alcanzar 75 °C).\n\n\nReposar y servir:\nRetira el pollo de la parrilla y déjalo reposar 5 minutos antes de servir para que los jugos se redistribuyan.\n\n\nOpcional\n\nAcompaña con una salsa, como chimichurri o tzatziki.\nSirve con ensalada, patatas asadas o verduras a la parrilla.\n\n¡Disfruta tu pollo a la parrilla!"},"Recetas/Pollo-al-horno":{"title":"Pollo al horno","links":[],"tags":["receta"],"content":"Si ya tienes el pollo cuarteado, la receta de pollo al horno cambia un poco, sobre todo en los tiempos de cocción. Aquí te explico cómo adaptarla:\nIngredientes:\n(Se mantienen igual, pero ajustarás según la cantidad de pollo cuarteado)\n\nTrozos de pollo (muslos, pechugas, alitas, etc.)\n3-4 dientes de ajo\n1 limón\nRomero fresco o tomillo\n1 cucharada de pimentón dulce\n2 cucharadas de aceite de oliva\nSal y pimienta\n100 ml de vino blanco (opcional)\nPatatas y cebolla (opcional)\n\nInstrucciones:\n\n\nPreparar los trozos de pollo: Precalienta el horno a 200°C. Lava y seca bien los trozos de pollo. Salpimienta por ambos lados.\n\n\nAromatizar el pollo: En un mortero, machaca los ajos y mezcla con el aceite de oliva, el pimentón dulce y el jugo de medio limón. Unta los trozos de pollo con esta mezcla.\n\n\nColocar el pollo en la bandeja: Coloca los trozos de pollo en una bandeja para horno, con la piel hacia arriba si estás usando partes con piel.\n\n\nOpcional - Cama de patatas y cebolla: Si quieres, puedes añadir patatas y cebolla cortadas en rodajas en la bandeja, creando una base. Coloca los trozos de pollo sobre ellas.\n\n\nAñadir vino (opcional): Si decides usar vino blanco, vierte un poco sobre los trozos de pollo y las patatas para darle más sabor.\n\n\nHornear: Los trozos de pollo cuarteados se cocinan más rápido que un pollo entero. Hornea a 200°C durante unos 35-45 minutos, dependiendo del tamaño de las piezas. A mitad de la cocción, puedes darles la vuelta para que se doren uniformemente. El pollo está listo cuando la piel esté dorada y crujiente y los jugos salgan claros al pinchar con un cuchillo.\n\n\nDejar reposar: Retira del horno y deja reposar los trozos de pollo durante unos 5-10 minutos antes de servir.\n\n\nEste método permite que el pollo se cocine de manera más rápida y uniforme, mientras que la marinada sigue impregnando todo el sabor. ¡Buen provecho!"},"Recetas/Receta-bizcocho":{"title":"Receta bizcocho","links":[],"tags":["recetas"],"content":"Aquí tienes una receta de bizcocho esponjoso en la que las claras se montan a punto de nieve para obtener una textura ligera y aireada:\n\nIngredientes:\n\n4 huevos (separar claras y yemas)\n200 g de azúcar (1 taza)\n120 ml de aceite (1/2 taza)\n125 g de yogur natural o griego (1 unidad pequeña)\n200 g de harina (1 1/2 tazas)\n10 g de levadura química o polvo de hornear (1 sobre)\nRalladura de limón o naranja (opcional)\nPizca de sal\n\n\nInstrucciones:\n\n\nPrecalentar el horno:\nPrecalienta el horno a 180 °C (350 °F) y engrasa un molde con mantequilla y harina o coloca papel de hornear.\n\n\nMontar las claras a punto de nieve:\nEn un bol grande y limpio, bate las claras con una pizca de sal hasta que formen picos firmes. Reserva.\n\n\nBatir las yemas con el azúcar:\nEn otro bol, bate las yemas con el azúcar hasta que la mezcla se vuelva cremosa y blanquee.\n\n\nAñadir los líquidos:\nIncorpora el aceite, el yogur y la ralladura de limón o naranja a las yemas. Mezcla bien.\n\n\nIncorporar la harina:\nTamiza la harina junto con la levadura y añádela poco a poco a la mezcla de yemas. Mezcla hasta integrar, pero sin batir en exceso.\n\n\nUnir las claras montadas:\nAñade las claras montadas en 2 o 3 tandas a la masa. Hazlo con movimientos envolventes, usando una espátula o cuchara grande, para no perder el aire.\n\n\nVerter en el molde:\nPasa la masa al molde preparado, alisando la superficie con una espátula.\n\n\nHornear:\nHornea durante 30-40 minutos o hasta que, al insertar un palillo en el centro, este salga limpio.\n\n\nEnfriar:\nDeja enfriar el bizcocho en el molde durante 10 minutos antes de desmoldar. Luego, enfría completamente sobre una rejilla.\n\n\n\nConsejo adicional:\nSi quieres un toque especial, espolvorea azúcar glas sobre el bizcocho una vez frío o acompáñalo con frutas frescas.\n¡Disfruta de este bizcocho ligero y delicioso! 😊"},"Recetas/Receta-sencilla-de-col":{"title":"Receta sencilla de col","links":[],"tags":["receta"],"content":"Aquí tienes una receta sencilla y deliciosa de col salteada con ajo y pimentón:\nIngredientes\n\n1 col (puedes usar col rizada, lombarda o repollo)\n2 dientes de ajo\n1 cucharadita de pimentón dulce (o picante, según prefieras)\nAceite de oliva\nSal y pimienta al gusto\n\nPreparación\n\nPrepara la col: Lava y corta la col en tiras finas o en trozos medianos, según tu preferencia.\nCalienta el aceite: En una sartén grande, pon un chorrito de aceite de oliva a fuego medio.\nSofríe el ajo: Pica los ajos finamente y sofríelos en el aceite hasta que estén dorados, pero con cuidado de no quemarlos.\nSaltea la col: Añade la col a la sartén y remueve bien para que se mezcle con el ajo y el aceite. Cocina durante 8-10 minutos, o hasta que esté tierna pero ligeramente crujiente.\nAñade el pimentón: Espolvorea el pimentón sobre la col y mezcla bien. Cocina por 1-2 minutos más.\nSazona: Agrega sal y pimienta al gusto.\n\nOpcional\n\nPuedes añadir un chorrito de limón o vinagre al final para darle un toque ácido.\nAcompaña con huevo frito, arroz o pan para un plato completo.\n\n¡Es rápido, saludable y lleno de sabor!\nHervir la col\nSi quieres hervir la col antes de saltearla, sigue estos pasos para que quede tierna pero no pasada:\nPasos para hervir la col\n\n\nLava y corta la col:\n\nLava bien las hojas y corta la col en tiras o trozos según prefieras.\n\n\n\nPrepara una olla con agua y sal:\n\nLlena una olla grande con agua suficiente para cubrir la col y añade una cucharadita de sal. Lleva el agua a ebullición.\n\n\n\nBlanquea la col (opcional):\n\nPara preservar su color y textura, blanquéala sumergiéndola en agua hirviendo durante solo 2-3 minutos y luego pásala inmediatamente a un bol con agua fría y hielo. Esto es útil si usas col lombarda o quieres una textura más firme.\n\n\n\nHierve la col:\n\nSi no haces el paso anterior, hierve la col directamente en el agua salada durante 5-7 minutos, dependiendo de la dureza de las hojas. Debe quedar tierna pero no deshacerse.\n\n\n\nEscurre bien:\n\nUsa un colador para retirar toda el agua y deja que repose un par de minutos para eliminar el exceso de humedad.\n\n\n\nSécala ligeramente (opcional):\n\nSi la col está muy húmeda, sécala un poco con papel de cocina antes de pasarla a la sartén. Así evitarás que salpique al contacto con el aceite.\n\n\n\nUna vez hervida, estará lista para saltearla con ajo, pimentón o los ingredientes que prefieras. Este método también ayuda a reducir el tiempo de cocción en la sartén."},"Recetas/Risotto-de-Manzana":{"title":"Risotto de Manzana","links":[],"tags":["recetas"],"content":"Aquí tienes la receta del risotto de manzana, un plato que combina la dulzura suave de la manzana con la cremosidad del risotto:\nIngredientes (para 4 personas):\n\n320 g de arroz arborio o carnaroli\n1-2 manzanas (mejor si son variedades dulces como Golden o Fuji)\n1 cebolla pequeña\n100 ml de vino blanco\n1 litro de caldo de verduras o pollo (mantener caliente)\n60 g de mantequilla\n50 g de queso parmesano rallado\n80 g de queso gorgonzola o de cabra (opcional)\nSal y pimienta al gusto\nAceite de oliva virgen extra\nUnas hojas de salvia fresca (opcional para decorar)\n\nInstrucciones:\n\n\nPreparación de la manzana: Pela la manzana y córtala en cubos pequeños. Reserva algunos cubos si quieres decorar al final.\n\n\nSofrito de cebolla: En una cazuela grande, calienta un poco de aceite de oliva a fuego medio. Agrega la cebolla picada finamente y sofríe hasta que esté transparente, unos 5 minutos.\n\n\nAñadir el arroz: Incorpora el arroz a la cazuela y tuéstalo durante 2-3 minutos, removiendo constantemente.\n\n\nDeglasar con vino: Añade el vino blanco y cocina hasta que se evapore por completo, removiendo.\n\n\nCocción del risotto: Comienza a añadir el caldo caliente poco a poco, un cucharón a la vez. Remueve constantemente para que el arroz libere su almidón. Sigue añadiendo caldo a medida que el arroz lo absorba, durante unos 18-20 minutos, o hasta que el arroz esté al dente.\n\n\nAgregar la manzana: A los 15 minutos de cocción del risotto, añade los cubos de manzana y remueve con cuidado. La manzana se cocinará suavemente y aportará un toque dulce.\n\n\nFinalizar el risotto: Una vez que el arroz esté en su punto, retira la cazuela del fuego. Añade la mantequilla y el queso parmesano, y si te gusta, el gorgonzola o queso de cabra. Remueve bien para que el risotto quede cremoso.\n\n\nAjustar el sabor: Prueba y ajusta con sal y pimienta al gusto.\n\n\nServir: Sirve de inmediato, decorando con algunos cubos de manzana cruda para aportar frescura, y, si lo deseas, algunas hojas de salvia fresca.\n\n\nEste risotto de manzana es suave, ligeramente dulce, y combina muy bien con el toque cremoso del queso."},"Recetas/Risotto-de-pera":{"title":"Risotto de pera","links":[],"tags":["recetas"],"content":"Aquí tienes la receta del risotto de manzana, un plato que combina la dulzura suave de la manzana con la cremosidad del risotto:\nIngredientes (para 4 personas):\n\n320 g de arroz arborio o carnaroli\n1-2 manzanas (mejor si son variedades dulces como Golden o Fuji)\n1 cebolla pequeña\n100 ml de vino blanco\n1 litro de caldo de verduras o pollo (mantener caliente)\n60 g de mantequilla\n50 g de queso parmesano rallado\n80 g de queso gorgonzola o de cabra (opcional)\nSal y pimienta al gusto\nAceite de oliva virgen extra\nUnas hojas de salvia fresca (opcional para decorar)\n\nInstrucciones:\n\n\nPreparación de la manzana: Pela la manzana y córtala en cubos pequeños. Reserva algunos cubos si quieres decorar al final.\n\n\nSofrito de cebolla: En una cazuela grande, calienta un poco de aceite de oliva a fuego medio. Agrega la cebolla picada finamente y sofríe hasta que esté transparente, unos 5 minutos.\n\n\nAñadir el arroz: Incorpora el arroz a la cazuela y tuéstalo durante 2-3 minutos, removiendo constantemente.\n\n\nDeglasar con vino: Añade el vino blanco y cocina hasta que se evapore por completo, removiendo.\n\n\nCocción del risotto: Comienza a añadir el caldo caliente poco a poco, un cucharón a la vez. Remueve constantemente para que el arroz libere su almidón. Sigue añadiendo caldo a medida que el arroz lo absorba, durante unos 18-20 minutos, o hasta que el arroz esté al dente.\n\n\nAgregar la manzana: A los 15 minutos de cocción del risotto, añade los cubos de manzana y remueve con cuidado. La manzana se cocinará suavemente y aportará un toque dulce.\n\n\nFinalizar el risotto: Una vez que el arroz esté en su punto, retira la cazuela del fuego. Añade la mantequilla y el queso parmesano, y si te gusta, el gorgonzola o queso de cabra. Remueve bien para que el risotto quede cremoso.\n\n\nAjustar el sabor: Prueba y ajusta con sal y pimienta al gusto.\n\n\nServir: Sirve de inmediato, decorando con algunos cubos de manzana cruda para aportar frescura, y, si lo deseas, algunas hojas de salvia fresca.\n\n\nEste risotto de manzana es suave, ligeramente dulce, y combina muy bien con el toque cremoso del queso."},"Recetas/Rustido-de-pollo":{"title":"Rustido de pollo","links":[],"tags":["receta"],"content":"Claro! El rustido de pollo es un plato clásico de la cocina catalana, perfecto para una comida reconfortante. Aquí tienes una receta básica para prepararlo:\nIngredientes:\n\n1 pollo troceado (puede ser con hueso y piel para más sabor)\n1 cebolla grande\n1 pimiento rojo (opcional)\n2-3 tomates maduros\n3 dientes de ajo\n1 hoja de laurel\n1 ramita de tomillo o romero\n1 vaso de vino blanco o brandy\nAceite de oliva\nSal y pimienta al gusto\nOpcional: almendras y avellanas para hacer una picada\n\nPreparación:\n\n\nDora el pollo: Sazona los trozos de pollo con sal y pimienta. En una cazuela grande, calienta un poco de aceite de oliva y dora el pollo a fuego medio-alto hasta que esté dorado por todos los lados. Retíralo y resérvalo.\n\n\nSofríe las verduras: En la misma cazuela, añade un poco más de aceite si es necesario y sofríe la cebolla picada finamente hasta que esté dorada y caramelizada. Luego, añade el ajo picado, el pimiento (si usas) y los tomates rallados. Cocina a fuego lento hasta que el sofrito esté bien concentrado y espeso.\n\n\nAñade el pollo y el vino: Vuelve a colocar el pollo en la cazuela, mezcla con el sofrito y añade el vino blanco o brandy. Cocina unos minutos para que se evapore el alcohol.\n\n\nCuece a fuego lento: Agrega la hoja de laurel, el tomillo o romero y un poco de agua o caldo (solo lo suficiente para que el pollo no se seque). Cocina a fuego lento, tapado, durante unos 45-60 minutos o hasta que el pollo esté tierno. Remueve de vez en cuando y añade más agua o caldo si ves que la salsa se reduce demasiado.\n\n\nOpcional: Añade la picada: Para darle un toque tradicional, puedes preparar una picada con almendras y avellanas trituradas y añadirla en los últimos minutos de cocción. Esto le dará un sabor más profundo y una textura deliciosa.\n\n\nSirve: Acompáñalo con patatas, arroz o pan.\n\n\n¡Espero que lo disfrutes! Este rustido es ideal para servir en familia o en días especiales."},"Recetas/Salsa-de-yogur":{"title":"Salsa de yogur","links":[],"tags":["receta"],"content":"Aquí tienes una receta sencilla para preparar una deliciosa salsa de yogur para kebab:\nIngredientes:\n\n1 yogur natural (sin azúcar, puede ser griego para mayor cremosidad).\n1 diente de ajo (o medio, si prefieres un sabor más suave).\n1 cucharada de zumo de limón (opcional, para un toque ácido).\n1 cucharada de aceite de oliva.\n1 cucharadita de menta fresca picada (o 1/2 cucharadita de menta seca).\n1/2 cucharadita de comino en polvo (opcional, para un toque exótico).\nSal y pimienta al gusto.\n\nInstrucciones:\n\nPicar el ajo: Pela el diente de ajo y pícalo muy fino o tritúralo con un prensa ajos.\nMezclar los ingredientes: En un bol, mezcla el yogur, el ajo picado, el zumo de limón y el aceite de oliva.\nAñadir las especias: Incorpora la menta, el comino, la sal y la pimienta. Remueve bien hasta obtener una mezcla homogénea.\nReposar: Si tienes tiempo, deja reposar la salsa en la nevera durante al menos 30 minutos para que los sabores se integren.\nServir: Acompaña tus kebabs con esta salsa y disfruta.\n\nConsejo:\nPuedes ajustar las cantidades según tu gusto, por ejemplo, añadiendo más ajo o menta. También puedes incluir una pizca de pimentón dulce o picante si buscas un toque diferente. ¡Es muy versátil!"},"Recetas/Ternera-a-la-plancha":{"title":"Ternera a la plancha","links":[],"tags":["recetas"],"content":"Ingredientes:\n\n1 filete de ternera (250 g aprox.)\nSal gruesa (o al gusto)\nPimienta negra recién molida (opcional)\nAceite de oliva virgen extra\n\nInstrucciones:\n\n\nPreparación del filete:\n\nSaca la ternera de la nevera al menos 30 minutos antes de cocinarla para que alcance temperatura ambiente. Esto ayuda a que se cocine de manera uniforme.\nSeca el filete con papel de cocina para eliminar el exceso de humedad y obtener una buena costra al cocinar.\n\n\n\nCalienta la plancha o sartén:\n\nColoca la plancha o sartén a fuego medio-alto hasta que esté muy caliente.\nAñade unas gotas de aceite de oliva y distribúyelas uniformemente con un pincel o servilleta.\n\n\n\nCocina la ternera:\n\nEspolvorea sal gruesa sobre el filete justo antes de colocarlo en la plancha.\nCocina el filete durante 2-4 minutos por lado, dependiendo del grosor y del punto que prefieras:\n\nPoco hecho: 2 minutos por lado.\nAl punto: 3 minutos por lado.\nHecho: 4 minutos por lado.\n\n\nNo presiones el filete con la espátula para evitar que pierda jugos.\n\n\n\nReposo:\n\nRetira el filete de la plancha y déjalo reposar sobre un plato durante 2-3 minutos. Esto permite que los jugos se redistribuyan y el filete quede más jugoso.\n\n\n\nCondimenta y sirve:\n\nEspolvorea un poco de pimienta negra si lo deseas.\nAcompaña con ensalada, verduras al vapor o unas patatas asadas.\n\n\n\n¡Disfruta tu ternera a la plancha jugosa y deliciosa!"},"Recetas/Tiempos-freidora-de-aire":{"title":"Tiempos freidora de aire","links":[],"tags":["receta"],"content":"Tiempos basados en mi experimentación personal.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProductoModoTiempoCroquetasAirfry14 minManzanasBake20 minPollo rebozadoAirfry14 minTostada pizzeadaBake8 minLimónDry6 horasBoniatoAirfry12-14 minEscalivadaRoast12 min"},"Recetas/Vichysoisse":{"title":"Vichysoisse","links":[],"tags":["receta"],"content":"La vichyssoise es una sopa fría de origen francés, hecha principalmente de puerros, patatas, cebolla, nata y caldo. Aquí tienes una receta sencilla:\nIngredientes (4 personas):\n\n3 puerros (parte blanca)\n1 cebolla mediana\n2 patatas medianas\n500 ml de caldo de pollo o vegetal\n200 ml de nata para cocinar\n2 cucharadas de mantequilla\nSal y pimienta al gusto\nCebollino picado para decorar (opcional)\n\nPreparación:\n\n\nPreparar los ingredientes:\nLava bien los puerros y corta la parte blanca en rodajas finas. Pela y corta la cebolla en trozos pequeños. Pela las patatas y córtalas en dados.\n\n\nRehogar:\nEn una olla, derrite la mantequilla a fuego medio. Añade los puerros y la cebolla, y sofríe durante 10 minutos, removiendo para que no se doren (solo deben ponerse tiernos).\n\n\nCocinar las patatas:\nAñade las patatas a la olla, mézclalas y vierte el caldo caliente. Lleva a ebullición, luego baja el fuego y cocina a fuego lento durante 20 minutos, hasta que las patatas estén blandas.\n\n\nTriturar:\nRetira del fuego y tritura con una batidora de mano o en una licuadora hasta obtener una crema suave.\n\n\nAñadir la nata:\nIncorpora la nata, mezcla bien y ajusta de sal y pimienta. Si prefieres una textura más líquida, añade un poco más de caldo o nata.\n\n\nEnfriar:\nDeja que la vichyssoise se enfríe a temperatura ambiente y luego refrigérala durante al menos 2 horas. La sopa debe servirse fría.\n\n\nServir:\nSirve en cuencos, decora con cebollino picado o un chorrito de aceite de oliva, si lo deseas.\n\n\n¡Listo! Disfruta de esta sopa suave y refrescante."},"Software-Engineering/How-tos/Changing-from-Docker-Desktop-to-Docker-Engine":{"title":"Changing from Docker Desktop to Docker Engine","links":[],"tags":["tech"],"content":"Changing to Docker Engine:\ndocker context use default\nChanging to Docker Desktop:\ndocker content use desktop-linux"},"Software-Engineering/How-tos/Software-to-install-in-a-newly-formatted-machine":{"title":"Software to install in a newly formatted machine","links":[],"tags":["tech"],"content":""},"Software-Engineering/Infographs/Explaining-CI-CD-to-a-kid":{"title":"Explaining CI-CD to a kid","links":["attachments/Pasted-image-20241024154043.png"],"tags":["tech"],"content":"\nOpen image"},"Software-Engineering/Infographs/Microservices-best-practices":{"title":"Microservices best practices","links":[],"tags":["tech"],"content":"\nReferences:\n\nblog.amigoscode.com/p/mircroservices-best-practices (great amount of explanation detail)\n"},"Software-Engineering/Infographs/Software-architecture-styles":{"title":"Software architecture styles","links":["attachments/Pasted-image-20241024155608.png"],"tags":["tech"],"content":"\nOpen image"},"Software-Engineering/Infographs/System-Design-Blueprint":{"title":"System Design Blueprint","links":[],"tags":["tech"],"content":"Purchase hi-res link\nA comprehensive visual guide that provides developers with a quick and easy reference to key concepts and best practices in system design. This handy cheatsheet or blueprint covers essential topics such as DNS, load balancing, API Gateway, video and image handling, caching, databases, unique ID generation, standard components like payment and recommendation services, and chat and streaming protocols. With this valuable resource at your fingertips, you’ll be well-equipped to tackle the challenges of designing and implementing scalable, efficient, and reliable systems.\nReferences\n\nblog.bytebytego.com/p/ep56-system-design-blueprint-the\nOriginal paper: www.ia.pw.edu.pl/~tkruk/edu/ersms/articles/SystemDesignBlueprint_TheUltimateGuide.pdf\n"},"Software-Engineering/Una-arquitectura-web-escalable":{"title":"Una arquitectura web escalable","links":[],"tags":["tech"],"content":"Diseñar una arquitectura escalable para una aplicación web basada en microservicios implica descomponer la aplicación en servicios independientes, cada uno con responsabilidades específicas, y asegurar que estos servicios puedan comunicarse entre sí de manera eficiente. A continuación, te presento una arquitectura escalable basada en microservicios:\n\n1. Componentes principales de la arquitectura\n1.1. Servicios de negocio\n\nServicio de Autenticación y Autorización: Gestiona la autenticación de usuarios (OAuth2, JWT) y la autorización de recursos.\nServicio de Usuarios: Maneja la creación, actualización y eliminación de perfiles de usuarios.\nServicio de Productos: Gestiona el catálogo de productos, incluyendo su creación, actualización y búsqueda.\nServicio de Pedidos: Encargado de la gestión de pedidos, incluyendo su creación, seguimiento y cancelación.\nServicio de Pagos: Integra pasarelas de pago y gestiona transacciones.\nServicio de Notificaciones: Envía notificaciones por correo electrónico, SMS o push.\n\n1.2. Servicios de infraestructura\n\nAPI Gateway: Punto de entrada único para todas las solicitudes. Enruta las solicitudes a los microservicios correspondientes y maneja la autenticación, limitación de tasa (rate limiting) y balanceo de carga.\nService Discovery: Registra y descubre los microservicios en tiempo real (por ejemplo, usando Eureka o Consul).\nConfiguración Centralizada: Almacena la configuración de los microservicios en un servidor centralizado (por ejemplo, Spring Cloud Config).\nMensajería: Usa un sistema de colas (por ejemplo, Kafka o RabbitMQ) para la comunicación asíncrona entre microservicios.\nAlmacenamiento en caché: Usa Redis o Memcached para almacenar datos en caché y mejorar el rendimiento.\nAlmacenamiento de datos: Cada microservicio puede tener su propia base de datos (por ejemplo, MySQL, PostgreSQL, MongoDB) para garantizar la independencia.\n\n1.3. Servicios de observabilidad\n\nLogging Centralizado: Usa herramientas como ELK Stack (Elasticsearch, Logstash, Kibana) o Fluentd para recopilar y analizar logs.\nMonitoreo y Métricas: Usa Prometheus y Grafana para monitorear el rendimiento de los microservicios.\nTracing Distribuido: Usa herramientas como Jaeger o Zipkin para rastrear solicitudes a través de los microservicios.\n\n1.4. Servicios de despliegue y orquestación\n\nContenedores: Empaqueta cada microservicio en un contenedor Docker.\nOrquestación de contenedores: Usa Kubernetes para gestionar la escalabilidad, el balanceo de carga y la alta disponibilidad de los contenedores.\nCI/CD: Implementa un pipeline de integración y despliegue continuo usando herramientas como Jenkins, GitLab CI o GitHub Actions.\n\n\n2. Comunicación entre microservicios\n\nSíncrona: Usa HTTP/REST o gRPC para solicitudes síncronas.\nAsíncrona: Usa mensajería (Kafka, RabbitMQ) para eventos asíncronos y desacoplamiento.\n\n\n3. Escalabilidad\n\nEscalabilidad horizontal: Añade más instancias de un microservicio bajo demanda usando Kubernetes.\nBalanceo de carga: Usa un balanceador de carga (por ejemplo, NGINX o AWS Elastic Load Balancer) para distribuir el tráfico entre instancias.\nAutoescalado: Configura reglas de autoescalado en Kubernetes basadas en métricas como el uso de CPU o memoria.\n\n\n4. Seguridad\n\nAutenticación y Autorización: Centraliza la autenticación en el API Gateway y usa tokens JWT para autorización.\nCifrado: Usa HTTPS para la comunicación entre servicios y cifra datos sensibles en las bases de datos.\nProtección de APIs: Implementa rate limiting y protección contra ataques DDoS.\n\n\n5. Almacenamiento de datos\n\nBases de datos por servicio: Cada microservicio tiene su propia base de datos para garantizar la independencia.\nReplicación y sharding: Configura réplicas y particionamiento para bases de datos críticas.\nCaché distribuida: Usa Redis o Memcached para almacenar datos en caché y reducir la carga en las bases de datos.\n\n\n6. Ejemplo de flujo de trabajo\n\nUn cliente realiza una solicitud a través del API Gateway.\nEl API Gateway valida la autenticación y enruta la solicitud al microservicio correspondiente.\nEl microservicio procesa la solicitud, interactúa con su base de datos y, si es necesario, publica un evento en el sistema de mensajería.\nOtros microservicios consumen el evento y realizan acciones adicionales (por ejemplo, enviar una notificación).\nLa respuesta se devuelve al cliente a través del API Gateway.\n\n\n7. Herramientas recomendadas\n\nDesarrollo: Spring Boot, Node.js, Python (FastAPI), Go.\nAPI Gateway: Kong, NGINX, Spring Cloud Gateway.\nService Discovery: Eureka, Consul.\nMensajería: Kafka, RabbitMQ.\nBases de datos: MySQL, PostgreSQL, MongoDB, Cassandra.\nCaché: Redis, Memcached.\nMonitoreo: Prometheus, Grafana.\nLogging: ELK Stack, Fluentd.\nTracing: Jaeger, Zipkin.\nContenedores: Docker.\nOrquestación: Kubernetes.\nCI/CD: Jenkins, GitLab CI, GitHub Actions.\n\n\n8. Consideraciones adicionales\n\nResiliencia: Implementa patrones como Circuit Breaker (Hystrix) y reintentos para manejar fallos.\nPruebas: Realiza pruebas unitarias, de integración y de carga para garantizar la calidad.\nDocumentación: Documenta las APIs usando herramientas como Swagger/OpenAPI.\n\nEsta arquitectura es escalable, modular y adecuada para aplicaciones web modernas que requieren alta disponibilidad y rendimiento."},"Software-Engineering/Useful-software-table":{"title":"Useful software table","links":[],"tags":["tech"],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNameDescriptionLinkKrohnkiteTiling manager for KDEOrganiseScript to organise files in FSorganize.readthedocs.io"},"TIL/Autosub-and-Handbrake":{"title":"Autosub","links":["tags/til"],"tags":["til"],"content":"til about AutoSub and HandBrake, a python script to generate subtitles from a videos and convert from DVD format to mp4 easily. They allowed me to recover and preserve some old DVDs I had hanging around!"},"TIL/Software-Engineering/Amazon-Cloud-Design-Patterns":{"title":"Amazon Cloud Design Patterns","links":["tags/til"],"tags":["til"],"content":"til Amazon has a nice page that explains which are some commonly used cloud design patterns, while at the same time it explains how you could use certain AWS services to achieve it.\nThe resource page is especially interesting."},"TIL/Software-Engineering/Architectural-Metapattens":{"title":"Architectural Metapatterns","links":[],"tags":["til"],"content":"Someone made the effort to write a compendium about software architecture patterns, and the best part of it is, it’s free!\ngithub.com/denyspoltorak/publications/blob/main/ArchitecturalMetapatterns/Architectural%20Metapatterns.pdf"},"TIL/Zine":{"title":"Zine","links":[],"tags":["til"],"content":"A zine is a way to fold paper so that it ends up being like a small book:\nplix.mit.edu/facilitator-resources/how-to-fold-a-zine\nSample game: fenthedev.itch.io/bard-zine"},"TIL/concepts/Digital-Garden":{"title":"Digital Garden","links":[],"tags":["til"],"content":"A digital garden is a personal, open, and evolving collection of notes, ideas, and resources shared on the internet, typically in a non-linear format. Unlike traditional blogs or websites that emphasize polished, finished content, a digital garden is more focused on the growth of knowledge over time, allowing for updates, revisions, and exploration of thoughts in various stages of development.\nBlog post: dev.to/jbranchaud/the-digital-garden-l10"},"TIL/concepts/Learn-in-Public":{"title":"Learn in Public","links":[],"tags":["til"],"content":"“Learning in public” refers to the practice of sharing your learning journey, progress, and even mistakes openly, often through blog posts, social media, videos, or other platforms. The idea is to publicly document what you’re learning, whether it’s a new skill, a subject, or a project, while engaging with a broader community.\nThis approach has several benefits:\n\nAccountability: By sharing your progress, you’re more likely to stick with your goals.\nFeedback: You can receive helpful feedback and advice from others, often accelerating your learning process.\nBuilding a reputation: It helps build your personal brand as someone who is curious, consistent, and willing to share knowledge.\nHelping others: Your experiences, challenges, and solutions can be valuable for others going through similar learning processes.\n\nFor example, someone learning a new programming language might write regular blog posts about what they’ve learned, or post code snippets and discuss challenges and breakthroughs on GitHub or Twitter.\nReferences:\n\nwww.youtube.com/watch\nwww.swyx.io/learn-in-public\n"},"TIL/obsidian/Cornell-Technique":{"title":"Cornell Technique","links":["tags/til"],"tags":["til"],"content":"til the Cornell technique, a note-taking technique that provides a writing structure to help summarisation of what you study, as well as posterior studying to improve retention. People even managed to introduce it into ObsidianMD.\nmedium.com/obsidian-observer/from-paper-to-pixel-mastering-the-cornell-note-taking-method-in-the-digital-age-dae13ed83c29"},"TIL/obsidian/Exporting-vault-to-HTML-and-publish-it":{"title":"Exporting vault to HTML and publish it","links":["tags/TIL"],"tags":["til","TIL"],"content":"TIL to export my ObsidianMD vault as HTML and publish it on Github Pages. Tried Jekyll first, wasn’t quite what I was looking for, so I used the Obsidian Webpage Export (github.com/KosmosisDire/obsidian-webpage-export). Unfortunately the documentation wasn’t available, so I made it work by intuition, but at least I have now my personal digital garden where I can share what I learn as a software engineer.\nVery immature for now, but hopefully the beginning of something greater. Check out my garden!"},"TIL/obsidian/Quartz":{"title":"Quartz","links":["tags/til"],"tags":["til"],"content":"til about Quartz (github.com/jackyzha0/quartz), a very nice framework that transforms my obsidian vault into a beautiful website."},"TIL/obsidian/Slides-in-Obsidian":{"title":"Slides in Obsidian","links":[],"tags":[],"content":"You can create awesome presentations with ObsidianMD and the Advanced Slides plugin. Check it at mszturc.github.io/obsidian-advanced-slides/.\nIncredibly beautiful and simple.\n"},"index":{"title":"Welcome to Rydra's Digital Garden","links":[],"tags":[],"content":"Hey ho! Welcome to my digital garden. I’m David Jiménez, Senior software engineer currently working @ Scopely Games. Restless and curious, I’ve worked +10 years as developer and architect across a variety of fields, ranging from industries like insurance, digital marketing, pharma, social networks and now videogames. But, above everything else, I am mostly a problem solver who thinks and tries to fit the best solution to the problem at hand instead of always using the same tool over and over again.\nThis garden is the place where I store all the knowledge I’m acquiring as time goes by, in an effort to follow the Learning in Public philosophy where I can improve my learning method by sharing what I know with everybody else. I hope by reading my notes you feel comfortable.\nSome places where you can get in touch with me:\n\nGithub\nLinkedIn\nDEV.to where I share my thoughts on technical posts\n"}}