{"Memes/SOLID-principles-with-penguins":{"title":"SOLID principles with penguins","links":[],"tags":["memes"],"content":"\n\n\n\n\n"},"My-CV":{"title":"CV","links":[],"tags":[],"content":"David Jiménez Martínez\nSenior Software Engineer, Python Developer\nGithub - Blog - LinkedIn\nSummary\nSoftware Engineer with +10 years of experience in the full development cycle of complex applications across a variety of fields, leading the development of software projects from inception and mentoring technical teams.\nSpecialised in:\n\nDesigning and building software from the ground\nBackend development in both monolithic and distributed, event-driven systems\nEnsuring technical excellence and empowering teams to deliver high quality, maintainable solutions\n\nWorking experience\nDIGIT, a Scopely Studio (1 year, 8 months)\nSenior Backend Developer, 2023/03 - present\nContributed to the implementation of new features for DIGIT games\nHighlights:\n\nDeveloped new features for the game, ensuring performance through monitoring using Datadog and Kibana, and stress testing with Locust\nImproved code scaffolding and testing practices for greater efficiency\nImproved code quality and consistency with mypy\nHosted technical trainings\n\n\nInari.io (4 years 9 months)\nBackend Architect, 2022/03 - 2023/03\nLed the technical development, testing and packaging of new platform features and proofs of concept, delivering new content to the product suites of Inari.\nPython Lead Engineer and Tech Coach, 2018/07 - 2022/03\nLed and mentored a cross-functional team of five developers.\nHighlights:\n\nDesigned, built and deployed a highly scalable, distributed policy admin platform, based on CQRS+ES/Clean architecture within a microservices ecosystem, following Domain Driven Design (DDD) best practices and patterns\nImplemented a retry/DLQ framework to use with Apache Kafka, greatly improving the performance over SQS\nEventual consistency for complex transactions achieved via choreography (event-driven) and orchestration (Taskflow)\nAll functionality was exposed and secured via a GraphQL API\nDesigned and implemented a library to abstract Blockchain to serve as an append-only event store\nDesigned and implemented a high-performance RBAC + ABAC auth system based on pathfinding, improving the performance of existing authorisation python libraries like Casbin\nTrained and mentored junior developers to bring them up to speed\n\n\nSelf-employed (5 years 4 months)\nMelange, 2017/10 - 2023/01\nDeveloper and maintainer of Melange, an open-source library aiming to ease the creation of Event-driven architectures with Python. Adopted at 21Buttons and Inari.io. Out of maintenance in favor of Kafka.\n\ngithub.com/Rydra/melange\n\n\n21Buttons (1 year)\nPython Architect and Developer, 2017/07 - 2018/07\nContributed to the implementation of new features for the 21Buttons fashion social network app, and led the development of a Marketplace platform.\nHighlights:\n\nLed the Introduction of good testing practices and DDD patterns into the project\nImproved the existing Django solution by structuring the code to follow the Hexagonal Architecture, decoupling the framework from the business logic\n\n\nVistaprint (11 months)\n.NET / C# Software Engineer, 2016/09 - 2017/08\nContributed to the maintenance of their website by developing new features to enhance SEO.\nHighlights:\n\nImproved existing features and added new API entrypoints using .NET and .NET Core, TDD with NUnit, deployed the solution using Terraform and Docker, all hosted in AWS\n\n\nTokiota (1 year 7 months)\nSenior .NET and Javascript Engineer, 2015/01 - 2016/07\nContributed as a consultant to the development of several projects:\n\nAn XML engine for processing employee data and generating payslips, as well as an internal administration tool in the context of a SCRUM team composed of seven members\nAn e-Commerce platform to sell football subscriptions in a team of three people\n\nHighlights:\n\nImplemented complex backend algorithms and designed the architecture of the project, decoupling NHibernate persistence from the business logic\nEncouraged DDD, TDD and design patterns best practices within the team\nImplemented a distributed software solution using Azure Service Fabric\n\n\nKing-eClient (1 year 1 month)\n.NET Lead Developer, 2014/01, 2015/01\nContributed as a consultant to the development efforts of two projects, an e-Commerce platform for a pharma company, and a mobile application for a public transportation company.\nHighlights:\n\nDesigned and implemented the e-Commerce platform from inception using the ASP.NET technologies\nDesigned and implemented the mobile application from inception using Xamarin\n\n\nGood Deal (1 year 1 month)\nAssociate .NET Developer, 2013/01 - 2014/01\nContributed to the development of new features for a software product targeted at retailers to deliver coupons to customers, based on their purchases and their profile, aiming to increase fidelisation and satisfaction.\n\nSant Celoni Town Hall\n.NET developer freelancer, 2011/06 - 2012/01\nLed a technical team of three member to develop a small e-Government platform to handle several types of form applications from citizens with ASP.NET.\n\nUniversitat Politècnica de Catalunya (1 year 8 months)\nDeveloper intern, 2008/07 - 2010/02\nContributed to the development of new features for the educational platform Moodle. Developed frontend features with PHP, HTML and CSS.\nTechnical Skills\nProgramming Skills\n\nAlgorithms and problem-solving mindset\nSOLID principles\nArchitectural patterns: Clean Architecture, CQRS + Event Sourcing, Event-driven, MVP\nTesting: Unit, Integration and End to End\nProgramming Paradigms: Domain-Driven Design, Object-Oriented Programming, Functional Programming\n\nBackend Technologies\n\nLanguages: Python, Javascript, C#, F#\nAsynchronous Frameworks: asyncio / anyio, Celery, Redis pubsub, Apache Kafka\nDatabases: PostgresSQL, Redis, Elasticsearch, Blockchain\nLocal environment development with containerized environments: Docker, Docker Compose\nWeb Frameworks: Django Rest Framework, Flask, FastAPI\nCloud providers: AWS, Heroku\n\nEducation &amp; Qualifications\nUniversitat Politècnica de Catalunya (UPC)\nMaster in Computing, Software Engineering, Information Systems and Databases, 2011 - 2013\nSpecialisation in software engineering principles, design patterns and database management\nUniversitat Politècnica de Catalunya (UPC)\nTechnical Engineer in Computing Management, 2006 - 2009\nTrainings and Certifications\nCommunicating with Diplomacy and Tact, 2024/03\nLinkedIn\nEffective communication strategies for multicultural teams\nPeopleware, Agile Teams and Management 3.0, 03/2023\n233 Academy\nPractices and techniques to create autonomous teams\nData Science and Machine Learning with Python - Hands On!, 2016/09\nUdemy\nDeep dive into the implementation of ML-powered python applications\nMachine Learning, 2016/09\nCoursera\nIntroduction to the concepts of machine learning, classification algorithms and recommendation systems\nMisc. Skills\nLanguages\nMother tongue: Catalan, Spanish\nOther languages:\n\nEnglish: Fluent, Cambridge First Certificate (B2)\n\nHobbies\n\nBoard games (chess, LOTR LCG, card games and strategy games in general)\nVideo games\nSports (gym, hiking, long walks)\nLearning new tech that can be used in my daily job\nA good tea with a good conversation topic\n"},"Recetas/Masa-de-pizza":{"title":"Masa de pizza","links":[],"tags":["recetas"],"content":"Ingredientes\n\nPor persona:\n\n100g harina\n50ml agua\nun poco de masa madre\n1/2 cucharada de aceite de oliva\nsal\n\n\n\nPreparación\n\nAmasar todo y dejar reposar unas cuantas horas (mejor del día anterior). Dejar tapado en un bol\nPrecocinar la masa previamente durante unos 5 minutos en el horno precalentado a 180, pero cuidado de que no se haga demasiado y cruja!\n"},"Software-Engineering/Infographs/Explaining-CI-CD-to-a-kid":{"title":"Explaining CI-CD to a kid","links":["attachments/Pasted-image-20241024154043.png"],"tags":["tech"],"content":"\nOpen image"},"Software-Engineering/Infographs/Software-architecture-styles":{"title":"Software architecture styles","links":["attachments/Pasted-image-20241024155608.png"],"tags":["tech"],"content":"\nOpen image"},"Software-Engineering/Infographs/System-Design-Blueprint":{"title":"System Design Blueprint","links":[],"tags":["tech"],"content":"Purchase hi-res link\nA comprehensive visual guide that provides developers with a quick and easy reference to key concepts and best practices in system design. This handy cheatsheet or blueprint covers essential topics such as DNS, load balancing, API Gateway, video and image handling, caching, databases, unique ID generation, standard components like payment and recommendation services, and chat and streaming protocols. With this valuable resource at your fingertips, you’ll be well-equipped to tackle the challenges of designing and implementing scalable, efficient, and reliable systems.\nReferences\n\nblog.bytebytego.com/p/ep56-system-design-blueprint-the\nOriginal paper: www.ia.pw.edu.pl/~tkruk/edu/ersms/articles/SystemDesignBlueprint_TheUltimateGuide.pdf\n"},"TIL/concepts/Digital-Garden":{"title":"Digital Garden","links":[],"tags":["til"],"content":"A digital garden is a personal, open, and evolving collection of notes, ideas, and resources shared on the internet, typically in a non-linear format. Unlike traditional blogs or websites that emphasize polished, finished content, a digital garden is more focused on the growth of knowledge over time, allowing for updates, revisions, and exploration of thoughts in various stages of development.\nBlog post: dev.to/jbranchaud/the-digital-garden-l10"},"TIL/concepts/Learn-in-Public":{"title":"Learn in Public","links":[],"tags":["til"],"content":"“Learning in public” refers to the practice of sharing your learning journey, progress, and even mistakes openly, often through blog posts, social media, videos, or other platforms. The idea is to publicly document what you’re learning, whether it’s a new skill, a subject, or a project, while engaging with a broader community.\nThis approach has several benefits:\n\nAccountability: By sharing your progress, you’re more likely to stick with your goals.\nFeedback: You can receive helpful feedback and advice from others, often accelerating your learning process.\nBuilding a reputation: It helps build your personal brand as someone who is curious, consistent, and willing to share knowledge.\nHelping others: Your experiences, challenges, and solutions can be valuable for others going through similar learning processes.\n\nFor example, someone learning a new programming language might write regular blog posts about what they’ve learned, or post code snippets and discuss challenges and breakthroughs on GitHub or Twitter.\nReferences:\n\nwww.youtube.com/watch\nwww.swyx.io/learn-in-public\n"},"TIL/obsidian/Exporting-vault-to-HTML-and-publish-it":{"title":"Exporting vault to HTML and publish it","links":["tags/TIL"],"tags":["TIL"],"content":"TIL to export my ObsidianMD vault as HTML and publish it on Github Pages. Tried Jekyll first, wasn’t quite what I was looking for, so I used the Obsidian Webpage Export (github.com/KosmosisDire/obsidian-webpage-export). Unfortunately the documentation wasn’t available, so I made it work by intuition, but at least I have now my personal digital garden where I can share what I learn as a software engineer.\nVery immature for now, but hopefully the beginning of something greater. Check out my garden!"},"TIL/obsidian/Quartz":{"title":"Quartz","links":["tags/til"],"tags":["til"],"content":"til about Quartz (github.com/jackyzha0/quartz), a very nice framework that transforms my obsidian vault into a beautiful website."},"TIL/obsidian/Slides-in-Obsidian":{"title":"Slides in Obsidian","links":[],"tags":[],"content":"You can create awesome presentations with ObsidianMD and the Advanced Slides plugin. Check it at mszturc.github.io/obsidian-advanced-slides/.\nIncredibly beautiful and simple.\n"},"index":{"title":"Welcome to Rydra's Digital Garden","links":[],"tags":[],"content":"Hey ho! Welcome to my digital garden. I’m David Jiménez, Senior software engineer currently working @ Scopely Games. Restless and curious, I’ve worked +10 years as developer and architect across a variety of fields, ranging from industries like insurance, digital marketing, pharma, social networks and now videogames. But, above everything else, I am mostly a problem solver who thinks and tries to fit the best solution to the problem at hand instead of always using the same tool over and over again.\nThis garden is the place where I store all the knowledge I’m acquiring as time goes by, in an effort to follow the Learning in Public philosophy where I can improve my learning method by sharing what I know with everybody else. I hope by reading my notes you feel comfortable.\nSome places where you can get in touch with me:\n\nGithub\nLinkedIn\nDEV.to where I share my thoughts on technical posts\n"}}